
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <title>5. 実験レポートの書き方 · 情報学群実験第2</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.0">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="report-work.html" />
    
    
    <link rel="prev" href="write.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../preface/">
            
                <a href="../preface/">
            
                    
                    はじめに
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../preface/goal.html">
            
                <a href="../preface/goal.html">
            
                    
                    達成目標
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../preface/bookmark.html">
            
                <a href="../preface/bookmark.html">
            
                    
                    情報のありか
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="header">Part I: i386アセンブリプログラミング</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="hellohex.html">
            
                <a href="hellohex.html">
            
                    
                    1. 機械語とアセンブリ言語
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="binaryfiles.html">
            
                <a href="binaryfiles.html">
            
                    
                    1-a. 補足：ファイル間の関係
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="github.html">
            
                <a href="github.html">
            
                    
                    1-b. GitHubアカウントの取得
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="i386.html">
            
                <a href="i386.html">
            
                    
                    1-c. i386アーキテクチャの基礎知識
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="arith.html">
            
                <a href="arith.html">
            
                    
                    2. さまざまな演算命令
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.2.1" data-path="github-team.html">
            
                <a href="github-team.html">
            
                    
                    2-a. グループ用GitHubリポジトリの作成
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.2" data-path="github-dev.html">
            
                <a href="github-dev.html">
            
                    
                    2-b. Gitを使った開発作業
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="jump.html">
            
                <a href="jump.html">
            
                    
                    3. 条件分岐と繰り返し
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="memory.html">
            
                <a href="memory.html">
            
                    
                    4. 主記憶領域
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.4.1" data-path="write.html">
            
                <a href="write.html">
            
                    
                    4-a. writeシステムコールによる文字列の出力
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="2.5" data-path="report.html">
            
                <a href="report.html">
            
                    
                    5. 実験レポートの書き方
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.5.1" data-path="report-work.html">
            
                <a href="report-work.html">
            
                    
                    5-a. 実験レポート練習問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="stack.html">
            
                <a href="stack.html">
            
                    
                    6. スタックとサブルーチン呼び出し
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.6.1" data-path="separate-asm.html">
            
                <a href="separate-asm.html">
            
                    
                    6-a. ソースファイルの分割
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="make.html">
            
                <a href="make.html">
            
                    
                    7. makeコマンドによる省力化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="logical-op.html">
            
                <a href="logical-op.html">
            
                    
                    8. 論理演算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.9" data-path="vram.html">
            
                <a href="vram.html">
            
                    
                    9. VRAM直接書き込み
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >5. 実験レポートの書き方</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x66F8;&#x304D;&#x65B9;">&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x66F8;&#x304D;&#x65B9;</h1><p>&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x66F8;&#x304D;&#x65B9;&#x3092;&#x5B66;&#x3076;&#x3053;&#x3068;&#x306F;&#xFF0C;&#x5DE5;&#x5B66;&#x7CFB;&#x5927;&#x5B66;&#x751F;&#x306B;&#x3068;&#x3063;&#x3066;&#x6700;&#x3082;&#x91CD;&#x8981;&#x306A;&#x4E8B;&#x67C4;&#x306E;&#x4E00;&#x3064;&#x3060;&#x3002;
&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306F;&#x300C;&#x25CB;&#x25CB;&#x306E;&#x73FE;&#x72B6;&#x306B;&#x3064;&#x3044;&#x3066;&#x307E;&#x3068;&#x3081;&#x3088;&#x300D;&#x306E;&#x3088;&#x3046;&#x306A;&#x8ABF;&#x67FB;&#x5831;&#x544A;&#x3068;&#x3082;&#x3061;&#x304C;&#x3046;&#x3057;&#xFF0C;&#x300C;&#x25CB;&#x25CB;&#x306B;&#x3064;&#x3044;&#x3066;&#x81EA;&#x5206;&#x306E;&#x8003;&#x3048;&#x3092;&#x8FF0;&#x3079;&#x3088;&#x300D;&#x306E;&#x3088;&#x3046;&#x306A;&#x5C0F;&#x8AD6;&#x6587;&#x3068;&#x3082;&#x3061;&#x304C;&#x3046;&#x3002;
&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306F;&#x300C;&#x5C0F;&#x578B;&#x306E;&#x7814;&#x7A76;&#x8AD6;&#x6587;&#x300D;&#x3060;&#x3002;
&#x7814;&#x7A76;&#x8AD6;&#x6587;&#x306E;&#x66F8;&#x304D;&#x65B9;&#x3092;&#x5B66;&#x3076;&#x305F;&#x3081;&#x306B;&#xFF0C;&#x8AF8;&#x541B;&#x306F;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x66F8;&#x304D;&#x65B9;&#x3092;&#x5B66;&#x3093;&#x3067;&#x3044;&#x308B;&#x3002;</p><p>&#x7814;&#x7A76;&#x8AD6;&#x6587;&#x306B;&#x306F;&#x7279;&#x6709;&#x306E;&#x300C;&#x30EB;&#x30FC;&#x30EB;&#x300D;&#x304C;&#x5B58;&#x5728;&#x3059;&#x308B;&#x3002;
&#x8AF8;&#x541B;&#x306F;&#xFF0C;&#x305D;&#x308C;&#x3089;&#x306E;&#x30EB;&#x30FC;&#x30EB;&#x3092;&#x5B66;&#x3073;&#xFF0C;&#x30EB;&#x30FC;&#x30EB;&#x306B;&#x5247;&#x3063;&#x3066;&#x6587;&#x66F8;&#x3092;&#x66F8;&#x304F;&#x7DF4;&#x7FD2;&#x3092;&#x3057;&#x306A;&#x304F;&#x3066;&#x306F;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;
&#x306A;&#x305C;&#x30EB;&#x30FC;&#x30EB;&#x304C;&#x3042;&#x308B;&#x306E;&#x3060;&#x308D;&#x3046;&#x304B;?&#x3000;&#x305D;&#x308C;&#x306F;&#xFF0C;&#x300C;&#x8AAD;&#x8005;&#x306B;&#x3068;&#x3063;&#x3066;&#x5FC5;&#x8981;&#x306A;&#x60C5;&#x5831;&#x3092;&#x8AAD;&#x8005;&#x304C;&#x5BB9;&#x6613;&#x306B;&#x8AAD;&#x307F;&#x53D6;&#x308C;&#x308B;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x305F;&#x3081;&#x300D;&#x3060;&#x3002;
&#x7814;&#x7A76;&#x8AD6;&#x6587;&#x3082;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3082;&#x300C;&#x8AAD;&#x8005;&#x306B;&#x60C5;&#x5831;&#x3084;&#x4E3B;&#x5F35;&#x3092;&#x4F1D;&#x3048;&#x308B;&#x305F;&#x3081;&#x300D;&#x306B;&#x66F8;&#x304F;&#x3082;&#x306E;&#x3067;&#x3042;&#x308A;&#xFF0C;&#x8AAD;&#x307F;&#x306B;&#x304F;&#x3044;&#x8AD6;&#x6587;&#x30FB;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306F;&#x5B58;&#x5728;&#x4FA1;&#x5024;&#x304C;&#x306A;&#x3044;&#x3002;</p><p>&#x5352;&#x696D;&#x8AD6;&#x6587;&#x3084;&#x305D;&#x306E;&#x4ED6;&#x306E;&#x7814;&#x7A76;&#x8AD6;&#x6587;&#xFF0C;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x8A08;&#x753B;&#x66F8;&#x3084;&#x5831;&#x544A;&#x66F8;&#xFF0C;&#x958B;&#x767A;&#x7269;&#x306E;&#x8A2D;&#x8A08;&#x66F8;&#x306A;&#x3069;&#xFF0C;&#x79D1;&#x5B66;&#x6280;&#x8853;&#x306B;&#x95A2;&#x3059;&#x308B;&#x4ED5;&#x4E8B;&#x306B;&#x306F;&#x5E38;&#x306B;&#x6587;&#x66F8;&#x4F5C;&#x6210;&#x306E;&#x4ED5;&#x4E8B;&#x304C;&#x4F34;&#x3046;&#x3002;
&#x7814;&#x7A76;&#x306B;&#x304A;&#x3044;&#x3066;&#x306F;&#x8AD6;&#x6587;&#x3053;&#x305D;&#x304C;&#x4E3B;&#x8981;&#x306A;&#x6210;&#x679C;&#x7269;&#x3067;&#x3042;&#x308A;&#xFF0C;&#x8AD6;&#x6587;&#x306B;&#x3088;&#x3063;&#x3066;&#x305D;&#x306E;&#x4ED5;&#x4E8B;&#x304C;&#x8A55;&#x4FA1;&#x3055;&#x308C;&#x308B;&#x3002;
&#x307B;&#x304B;&#x306E;&#x4ED5;&#x4E8B;&#x3067;&#x3082;&#xFF0C;&#x6587;&#x66F8;&#x306B;&#x3088;&#x3063;&#x3066;&#x4ED5;&#x4E8B;&#x304C;&#x8A55;&#x4FA1;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x306F;&#x591A;&#x3005;&#x3042;&#x308B;&#x3002;
&#x300C;&#x30EB;&#x30FC;&#x30EB;&#x3092;&#x7406;&#x89E3;&#x3057;&#xFF0C;&#x30EB;&#x30FC;&#x30EB;&#x304B;&#x3089;&#x9038;&#x8131;&#x3057;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3057;&#x306A;&#x304C;&#x3089;&#xFF0C;&#x4E3B;&#x5F35;&#x3092;&#x88CF;&#x4ED8;&#x3051;&#x308B;&#x6839;&#x62E0;&#x3092;&#x3069;&#x3046;&#x793A;&#x305B;&#x3070;&#x8AAD;&#x8005;&#x304C;&#x7D0D;&#x5F97;&#x3059;&#x308B;&#x304B;&#x8003;&#x3048;&#x3066;&#xFF0C;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x9806;&#x5E8F;&#xFF0C;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x8868;&#x73FE;&#x3067;&#x8A18;&#x8FF0;&#x3059;&#x308B;&#x300D;
&#x3053;&#x3068;&#x304C;&#x5FC5;&#x8981;&#x3060;&#x304C;&#xFF0C;&#x3082;&#x3061;&#x308D;&#x3093;&#x3053;&#x308C;&#x306F;&#x975E;&#x5E38;&#x306B;&#x96E3;&#x3057;&#x3044;&#x4ED5;&#x4E8B;&#x3060;&#x3002;
&#x3059;&#x3050;&#x306B;&#x4FEE;&#x5F97;&#x3067;&#x304D;&#x308B;&#x3082;&#x306E;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;
&#x5352;&#x696D;&#x307E;&#x3067;&#x306B;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x3088;&#x308A;&#x793E;&#x4F1A;&#x306B;&#x51FA;&#x3066;&#x304B;&#x3089;&#x3082;&#xFF0C;&#x6642;&#x9593;&#x3092;&#x639B;&#x3051;&#x3066;&#x7DF4;&#x7FD2;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;</p><h2 id="&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3068;&#x306F;&#x4F55;&#x304B;">&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3068;&#x306F;&#x4F55;&#x304B;</h2><h3 id="&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306F;&#x65E5;&#x8A18;&#x3058;&#x3083;&#x306A;&#x3044;&#xFF01;">&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306F;&#x65E5;&#x8A18;&#x3058;&#x3083;&#x306A;&#x3044;&#xFF01;</h3><p>&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306F;&#xFF0C;&#x500B;&#x4EBA;&#x7684;&#x610F;&#x898B;&#x3084;&#x611F;&#x60F3;&#x3092;&#x66F8;&#x304F;&#x6587;&#x66F8;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;</p><p>&#x60AA;&#x3044;&#x4F8B;:</p><blockquote><p>&#x300C;&#x25CB;&#x25CB;&#x304C;&#x96E3;&#x3057;&#x304B;&#x3063;&#x305F;&#xFF0E;&#x300D;<br>
&#x300C;&#x25CB;&#x25CB;&#x3068;&#x3044;&#x3046;&#x90E8;&#x5206;&#x3092;&#x3042;&#x307E;&#x308A;&#x7406;&#x89E3;&#x3067;&#x304D;&#x3066;&#x3044;&#x306A;&#x3044;&#x306E;&#x3067;&#xFF0C;&#x7406;&#x89E3;&#x3057;&#x3066;&#x3044;&#x304F;&#x3053;&#x3068;&#x304C;&#x3053;&#x308C;&#x304B;&#x3089;&#x5FC5;&#x8981;&#x3060;&#x3068;&#x8003;&#x3048;&#x308B;&#xFF0E;&#x300D;<br>
&#x300C;&#x3053;&#x308C;&#x3089;&#x306E;&#x8AB2;&#x984C;&#x306B;&#x53D6;&#x308A;&#x7D44;&#x307F;&#xFF0C;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x3092;&#x4F53;&#x611F;&#x3067;&#x304D;&#x305F;&#xFF0E;&#x307E;&#x305F;&#xFF0C;&#x30DD;&#x30A4;&#x30F3;&#x30BF;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x304C;&#x3088;&#x304F;&#x308F;&#x304B;&#x3063;&#x305F;&#xFF0E;&#x300D;</p></blockquote><p>&#x300C;&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#x306F;&#x5B66;&#x7FD2;&#x3067;&#x3042;&#x308B;&#x300D;&#x3068;&#x8003;&#x3048;&#xFF0C;&#x305D;&#x306E;&#x5831;&#x544A;&#x66F8;&#x3092;&#x66F8;&#x3053;&#x3046;&#x3068;&#x3059;&#x308B;&#x3068;&#xFF0C;&#x7D50;&#x8AD6;&#x304C;&#x4E0A;&#x8A18;&#x306E;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x3066;&#x3057;&#x307E;&#x3046;&#x306E;&#x304B;&#x3082;&#x77E5;&#x308C;&#x306A;&#x3044;&#x3002;
&#x3057;&#x304B;&#x3057;&#xFF0C;&#x300C;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x66F8;&#x304F;&#x4E0A;&#x3067;&#x306E;&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#x300D;&#x306F;&#x300C;&#x5B66;&#x7FD2;&#x300D;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;
&#x300E;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x4F5C;&#x6210;&#x6CD5;&#x300F;&#x3068;&#x3044;&#x3046;&#x66F8;&#x7C4D;&#x306E;&#x4E00;&#x7BC0;&#x3092;&#x4EE5;&#x4E0B;&#x306B;&#x5F15;&#x7528;&#x3059;&#x308B;&#x3002;</p><blockquote><p>&#x3055;&#x3066;&#xFF0C;&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#x3067;&#x3042;&#x308B;&#x304C;&#xFF0C;&#x9593;&#x9055;&#x3063;&#x3066;&#x3082;&#xFF0C;&#x300C;&#x25CB;&#x25CB;&#x306E;&#x6280;&#x8853;&#x3092;&#x5B66;&#x3076;&#x305F;&#x3081;&#x300D;&#x3068;&#x304B;&#x300C;&#x25CB;&#x25CB;&#x3084;&#x25B3;&#x25B3;&#x306E;&#x6E2C;&#x5B9A;&#x65B9;&#x6CD5;&#x3092;&#x5B66;&#x3076;&#x305F;&#x3081;&#x300D;&#x3068;&#x3044;&#x3063;&#x305F;&#x3088;&#x3046;&#x306B;&#x66F8;&#x3044;&#x3066;&#x306F;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;
&#x305F;&#x3068;&#x3048;&#x5148;&#x751F;&#x3068;&#x3057;&#x3066;&#x306F;&#xFF0C;&#x305D;&#x3046;&#x3044;&#x3063;&#x305F;&#x6559;&#x80B2;&#x76EE;&#x7684;&#x3092;&#x3082;&#x3063;&#x3066;&#x5B66;&#x751F;&#x306B;&#x5B9F;&#x9A13;&#x3092;&#x3055;&#x305B;&#x3066;&#x3044;&#x308B;&#x306E;&#x3060;&#x3068;&#x3057;&#x3066;&#x3082;&#xFF0C;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3067;&#x306F;&#x305D;&#x306E;&#x3088;&#x3046;&#x306B;&#x66F8;&#x3044;&#x3066;&#x306F;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;
&#x3068;&#x3044;&#x3046;&#x306E;&#x3082;&#xFF0C;&#x3042;&#x306A;&#x305F;&#x306F;&#x30B7;&#x30E9;&#x30D0;&#x30B9;&#x3092;&#x66F8;&#x3044;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x306F;&#x306A;&#x304F;&#xFF0C;&#x3042;&#x304F;&#x307E;&#x3067;&#x3082;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x66F8;&#x3044;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3042;&#x308B;&#x304B;&#x3089;&#x3060;&#x3002;</p><p>--- C.S.Lobban, M.Schefter&#x300E;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x4F5C;&#x6210;&#x6CD5;&#x300F;&#x7560;&#x5C71;, &#x5927;&#x68EE; &#x8A33;, &#x4E38;&#x5584;&#x51FA;&#x7248;, p.13, 2011.<br>
<span style="font-size: smaller">&#x539F;&#x8457;: Successful Lab Reports: A Manual for Science Students, Cambridge University Press, 1992.</span></p></blockquote><p>&#x3067;&#x306F;&#xFF0C;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x306F;&#x4F55;&#x3092;&#x66F8;&#x3051;&#x3070;&#x3088;&#x3044;&#x306E;&#x3060;&#x308D;&#x3046;&#x304B;?
&#x300C;&#x5B9F;&#x9A13;&#x3092;<strong>&#x5C0F;&#x898F;&#x6A21;&#x306A;&#x7814;&#x7A76;</strong>&#x3068;&#x8003;&#x3048;&#xFF0C;&#x4F55;&#x3092;&#x660E;&#x3089;&#x304B;&#x306B;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x4F55;&#x3092;&#x884C;&#x3044;&#xFF0C;&#x3069;&#x3046;&#x3044;&#x3046;&#x7D50;&#x8AD6;&#x304C;&#x5F97;&#x3089;&#x308C;&#x305F;&#x306E;&#x304B;&#x3092;&#x66F8;&#x304F;&#x300D;&#x3068;&#x3044;&#x3046;&#x306E;&#x304C;&#x7B54;&#x3060;&#x3002;</p><p>&#x3069;&#x306E;&#x3088;&#x3046;&#x306A;&#x5B9F;&#x9A13;&#x3082;&#x7814;&#x7A76;&#x3082;&#xFF0C;&#x305D;&#x306E;&#x76EE;&#x7684;&#x306F;&#x300C;<strong>&#x4EEE;&#x8AAC;&#x306E;&#x691C;&#x8A3C;</strong>&#x300D;&#x3067;&#x3042;&#x308B;&#x3068;&#x8A00;&#x3046;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;
&#x300C;&#x62B5;&#x6297;&#x3092;&#x6D41;&#x308C;&#x308B;&#x96FB;&#x6D41;&#x306F;&#x96FB;&#x5727;&#x306B;&#x6BD4;&#x4F8B;&#x3059;&#x308B;&#x300D;&#x300C;&#x632F;&#x308A;&#x5B50;&#x306E;&#x5468;&#x671F;&#x306F;&#x632F;&#x308A;&#x5E45;&#x306B;&#x3088;&#x3089;&#x305A;&#x4E00;&#x5B9A;&#x3067;&#x3042;&#x308B;&#x300D;&#x3068;&#x3044;&#x3063;&#x305F;&#x547D;&#x984C;&#x304C;&#x300C;&#x4EEE;&#x8AAC;&#x300D;&#x3067;&#x3042;&#x308A;&#xFF0C;&#x305D;&#x308C;&#x3092;&#x5BA2;&#x89B3;&#x7684;&#x306A;&#x65B9;&#x6CD5;&#x3067;&#x78BA;&#x304B;&#x3081;&#x308B;&#x306E;&#x304C;&#x5B9F;&#x9A13;&#x3067;&#x3042;&#x308B;&#x3002;</p><blockquote><p>&#x5B9F;&#x9A13;&#x30DE;&#x30CB;&#x30E5;&#x30A2;&#x30EB;&#x3092;&#x8AAD;&#x3093;&#x3067;&#x3082;&#xFF0C;&#x305D;&#x3057;&#x3066;&#x5148;&#x751F;&#x306E;&#x8A00;&#x3063;&#x305F;&#x3053;&#x3068;&#x3070;&#x3092;&#x632F;&#x308A;&#x8FD4;&#x3063;&#x3066;&#x3082;&#xFF0C;&#x4EEE;&#x8AAC;&#x3068;&#x306A;&#x308B;&#x3082;&#x306E;&#x304C;&#x4EEE;&#x306B;&#x898B;&#x3064;&#x304B;&#x3089;&#x306A;&#x304F;&#x3066;&#x3082;&#xFF0C;&#x3067;&#x3082;&#xFF0C;&#x4EEE;&#x8AAC;&#x306F;&#x5FC5;&#x305A;&#x3042;&#x308B;&#x3082;&#x306E;&#x3060;&#x3002;
(&#x4E2D;&#x7565;)
&#x4EEE;&#x8AAC;&#x3092;&#x7ACB;&#x3066;&#x306A;&#x3044;&#x3067;&#x5B9F;&#x9A13;&#x3092;&#x3059;&#x308B;&#x306A;&#x3093;&#x3066;&#x3044;&#x3046;&#x3053;&#x3068;&#x306F;&#x3042;&#x308A;&#x5F97;&#x306A;&#x3044;&#x3057;&#xFF0C;&#x5B9F;&#x9A13;&#x3068;&#x306F;&#xFF0C;&#x305D;&#x3082;&#x305D;&#x3082;&#xFF0C;&#x4EEE;&#x8AAC;&#x3068;&#x5E30;&#x7121;&#x4EEE;&#x8AAC; (&#x4EEE;&#x8AAC;&#x3092;&#x5426;&#x5B9A;&#x3059;&#x308B;&#x547D;&#x984C;) &#x306E;&#x3069;&#x3061;&#x3089;&#x3092;&#x652F;&#x6301;&#x3059;&#x308B;&#x306E;&#x304B;&#xFF0C;&#x305D;&#x306E;&#x88CF;&#x4ED8;&#x3051;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x96C6;&#x3081;&#x308B;&#x305F;&#x3081;&#x306B;&#x3059;&#x308B;&#x3082;&#x306E;&#x3067;&#x3042;&#x308B;&#x3002;
(&#x4E2D;&#x7565;)
&#x554F;&#x984C;&#x3092;&#x3061;&#x3083;&#x3093;&#x3068;&#x7406;&#x89E3;&#x3057;&#x306A;&#x3044;&#x3067;&#x5B9F;&#x9A13;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x3067;&#x306F;&#xFF0C;&#x4E0E;&#x3048;&#x3089;&#x308C;&#x305F;&#x8AB2;&#x984C;&#x306B;&#x3064;&#x3044;&#x3066;&#x81EA;&#x5206;&#x306F;&#x4F55;&#x3082;&#x308F;&#x304B;&#x3063;&#x3066;&#x3044;&#x306A;&#x3044;&#x3053;&#x3068;&#x3092;&#x5148;&#x751F;&#x306B;&#x30A2;&#x30D4;&#x30FC;&#x30EB;&#x3057;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x306A;&#x3082;&#x306E;&#x3067;&#x3042;&#x308B;&#x3002;</p><p>--- &#x300E;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x4F5C;&#x6210;&#x6CD5;&#x300F;pp.9--10.</p></blockquote><p>&#x4E0A;&#x8A18;&#x306E;&#x5F15;&#x7528;&#x6587;&#x306F;&#xFF0C;&#x7269;&#x7406;&#x5B66;&#x30FB;&#x5316;&#x5B66;&#x30FB;&#x751F;&#x7269;&#x5B66;&#x306A;&#x3069;&#x306E;&#x81EA;&#x7136;&#x79D1;&#x5B66;&#x306E;&#x5B9F;&#x9A13;&#x306B;&#x95A2;&#x3059;&#x308B;&#x3082;&#x306E;&#x3067;&#x3042;&#x308B;&#x3002;
&#x4E00;&#x65B9;&#xFF0C;&#x672C;&#x79D1;&#x76EE;&#x306E;&#x3088;&#x3046;&#x306A;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x4F5C;&#x6210;&#x5B9F;&#x9A13;&#x3067;&#x306F;&#xFF0C;&#x691C;&#x8A3C;&#x3059;&#x3079;&#x304D;&#x4EEE;&#x8AAC;&#x304C;&#x660E;&#x767D;&#x3067;&#x306A;&#x3044;&#x3068;&#x611F;&#x3058;&#x308B;&#x3053;&#x3068;&#x304C;&#x591A;&#x3044;&#x3068;&#x601D;&#x3046;&#x3002;
&#x3057;&#x304B;&#x3057;&#xFF0C;&#x300C;&#x691C;&#x8A3C;&#x3059;&#x3079;&#x304D;&#x4EEE;&#x8AAC;&#x300D;&#x306F;&#x5FC5;&#x305A;&#x5B58;&#x5728;&#x3059;&#x308B;&#x3002;
&#x4F8B;&#x3048;&#x3070;&#xFF0C;&#x753B;&#x50CF;&#x51E6;&#x7406;&#x3092;&#x884C;&#x3046;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x4F5C;&#x308B;&#x8AB2;&#x984C;&#x3067;&#x3042;&#x308C;&#x3070;&#xFF0C;
&#x300C;&#x8A08;&#x7B97;&#x5F0F;A&#x306B;&#x5F93;&#x3063;&#x3066;&#x8A08;&#x7B97;&#x3092;&#x884C;&#x3046;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#xFF0C;&#x5B9F;&#x969B;&#x306B;&#x753B;&#x50CF;&#x306B;&#x5BFE;&#x3057;&#x3066;X&#x3068;&#x3044;&#x3046;&#x52B9;&#x679C;
&#xFF08;&#x30E2;&#x30CE;&#x30AF;&#x30ED;&#x30FC;&#x30E0;&#x5316;&#xFF0C;&#x9BAE;&#x92ED;&#x5316;&#xFF0C;&#x306A;&#x3069;&#xFF09;&#x304C;&#x5F97;&#x3089;&#x308C;&#x308B;&#x3053;&#x3068;&#x3092;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x300D;
&#x3053;&#x3068;&#x304C;&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#x3067;&#x3042;&#x308A;&#xFF0C;
&#x300C;&#x8A08;&#x7B97;&#x5F0F;A&#x306B;&#x5F93;&#x3063;&#x305F;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306B;&#x3088;&#x3063;&#x3066;&#x52B9;&#x679C;X&#x304C;&#x5F97;&#x3089;&#x308C;&#x308B;&#x300D;&#x304C;&#x300C;&#x4EEE;&#x8AAC;&#x300D;&#x3068;&#x8A00;&#x3048;&#x308B;&#x3060;&#x308D;&#x3046;
&#xFF08;&#x3082;&#x3061;&#x308D;&#x3093;&#x305D;&#x306E;&#x4EEE;&#x8AAC;&#x304C;&#x6210;&#x308A;&#x7ACB;&#x3064;&#x3053;&#x3068;&#x306F;&#x660E;&#x3089;&#x304B;&#x306A;&#x306E;&#x3060;&#x304C;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x4F8B;&#x3048;&#x3070;&#x300C;&#x62B5;&#x6297;&#x3092;&#x6D41;&#x308C;&#x308B;&#x96FB;&#x6D41;&#x306F;&#x96FB;&#x5727;&#x306B;&#x6BD4;&#x4F8B;&#x3059;&#x308B;&#x300D;&#x3053;&#x3068;&#x3092;&#x8ABF;&#x3079;&#x308B;&#x7269;&#x7406;&#x5B66;&#x306E;&#x5B9F;&#x9A13;&#x3067;&#x3082;&#x540C;&#x3058;&#x3067;&#x3042;&#x308B;&#x3002;
&#x6388;&#x696D;&#x3068;&#x3057;&#x3066;&#x306E;&#x5B9F;&#x9A13;&#x306F;&#x901A;&#x5E38;&#xFF0C;&#x6210;&#x308A;&#x7ACB;&#x3064;&#x3053;&#x3068;&#x304C;&#x308F;&#x304B;&#x3063;&#x3066;&#x3044;&#x308B;&#x4EEE;&#x8AAC;&#x3092;&#x6539;&#x3081;&#x3066;&#x691C;&#x8A3C;&#x3059;&#x308B;&#x3082;&#x306E;&#x3067;&#x3042;&#x308B;&#xFF09;&#x3002;
&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#x304A;&#x3088;&#x3073;&#x691C;&#x8A3C;&#x3059;&#x3079;&#x304D;&#x4EEE;&#x8AAC;&#x304C;&#x3088;&#x304F;&#x308F;&#x304B;&#x3089;&#x306A;&#x3051;&#x308C;&#x3070;&#xFF0C;
&#x300C;&#x305D;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x4F5C;&#x308B;&#x3053;&#x3068;&#x3067;&#x4F55;&#x304C;&#x78BA;&#x304B;&#x3081;&#x3089;&#x308C;&#x308B;&#x306E;&#x304B;?&#x300D;
&#x300C;&#x5B9F;&#x969B;&#x306B;&#x4F5C;&#x3089;&#x306A;&#x3044;&#x3068;&#x78BA;&#x8A8D;&#x3067;&#x304D;&#x306A;&#x3044;&#x3053;&#x3068;&#x306F;&#x4F55;&#x304B;?&#x300D;&#x3068;&#x8003;&#x3048;&#x3066;&#x307F;&#x308B;&#x3068;&#x3088;&#x3044;&#x3002;</p><h3 id="&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x69CB;&#x6210;">&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x69CB;&#x6210;</h3><p>&#x5206;&#x91CE;&#x3092;&#x554F;&#x308F;&#x305A;&#xFF0C;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x5168;&#x4F53;&#x7684;&#x306A;&#x6D41;&#x308C;&#x306F;&#xFF0C;&#x57FA;&#x672C;&#x7684;&#x306B;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B;&#x306A;&#x308B;&#x3002;</p><p><strong>&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;</strong> (&#x4F55;&#x306E;&#x305F;&#x3081;&#x306B;)
  &#x2192; <strong>&#x5B9F;&#x9A13;&#x65B9;&#x6CD5;</strong> (&#x4F55;&#x3092;&#x884C;&#x3044;)
  &#x2192; <strong>&#x5B9F;&#x9A13;&#x7D50;&#x679C;</strong> (&#x3069;&#x3046;&#x306A;&#x3063;&#x305F;&#x304B;)
  &#x2192; <strong>&#x8003;&#x5BDF;</strong> (&#x4F55;&#x304C;&#x4E3B;&#x5F35;&#x3067;&#x304D;&#x308B;&#x304B;)</p><p>&#x3053;&#x306E;4&#x9805;&#x76EE;&#x3092;&#x305D;&#x308C;&#x305E;&#x308C;&#x7BC0;&#x3068;&#x3057;&#x3066;&#x6587;&#x66F8;&#x306B;&#x3059;&#x308C;&#x3070;&#xFF0C;&#x7ACB;&#x6D3E;&#x306A;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x5B8C;&#x6210;&#x3060;&#x3002;</p><p>&#x300C;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x300D;&#x3067;&#x306F;&#xFF0C;&#x89B3;&#x6E2C;&#x3055;&#x308C;&#x305F;&#x4E8B;&#x5B9F;&#x3092;&#x8FF0;&#x3079;&#x308B;&#x3002;
&#x300C;&#x8003;&#x5BDF;&#x300D;&#x3067;&#x306F;&#xFF0C;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x3092;&#x57FA;&#x306B;&#x4EEE;&#x8AAC;&#x306E;&#x691C;&#x8A3C;&#x3092;&#x8A66;&#x307F;&#x308B;&#x3002;
&#x4F8B;&#x3048;&#x3070;&#x300C;&#x62B5;&#x6297;R1&#x306E;&#x4E21;&#x7AEF;&#x306E;&#x96FB;&#x4F4D;&#x5DEE;&#x304C;5.00V&#xFF0C;&#x6D41;&#x308C;&#x308B;&#x96FB;&#x6D41;&#x304C;9.83mA&#x3060;&#x3063;&#x305F;&#xFF0E;&#x300D;&#x3068;&#x3044;&#x3046;&#x8A18;&#x8FF0;&#x306F;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x3092;&#x8FF0;&#x3079;&#x3066;&#x304A;&#x308A;&#xFF0C;
&#x300C;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x304B;&#x3089;&#xFF0C;&#x62B5;&#x6297;&#x306B;&#x6D41;&#x308C;&#x308B;&#x96FB;&#x6D41;&#x306F;&#x4E21;&#x7AEF;&#x306E;&#x96FB;&#x4F4D;&#x5DEE;&#x306B;&#x6BD4;&#x4F8B;&#x3059;&#x308B;&#x3068;&#x8A00;&#x3048;&#x308B;&#xFF0E;&#x300D;&#x3068;&#x3044;&#x3046;&#x8A18;&#x8FF0;&#x306F;&#x8003;&#x5BDF;&#x3092;&#x8FF0;&#x3079;&#x3066;&#x3044;&#x308B;&#x3002;</p><p>&#x300C;<strong>&#x672B;&#x5C3E;&#x304B;&#x3089;&#x524D;&#x306B;&#x5411;&#x304B;&#x3063;&#x3066;&#x66F8;&#x3044;&#x3066;&#x3044;&#x304F;</strong>&#x300D;&#x3068;&#x3044;&#x3046;&#x6226;&#x7565;&#x304C;&#xFF0C;&#x8AD6;&#x6587;&#x3084;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x4F5C;&#x6210;&#x6CD5;&#x3068;&#x3057;&#x3066;&#x3088;&#x304F;&#x63A8;&#x5968;&#x3055;&#x308C;&#x308B;&#x3002;</p><ol><li>&#x300C;&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#x300D;&#x306B;&#x57FA;&#x3065;&#x3044;&#x3066;&#xFF0C;&#x300C;&#x3069;&#x3046;&#x3044;&#x3046;&#x7D50;&#x8AD6;&#x3092;&#x8FF0;&#x3079;&#x308B;&#x304B;?&#xFF08;&#x4F8B;&#x3048;&#x3070;&#x300E;&#x25CB;&#x25CB;&#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x304C;&#x308F;&#x304B;&#x3063;&#x305F;&#x300F;&#x300E;&#x25CB;&#x25CB;&#x3092;&#x78BA;&#x8A8D;&#x3067;&#x304D;&#x305F;&#x300F;&#x306A;&#x3069;&#xFF09;&#x300D;&#x3092;&#x8003;&#x3048;&#x308B;&#x3002;
</li>
<li>&#x300C;&#x305D;&#x3046;&#x4E3B;&#x5F35;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x306F;&#xFF08;&#x305D;&#x308C;&#x3092;&#x8AAD;&#x8005;&#x306B;&#x7D0D;&#x5F97;&#x3055;&#x305B;&#x308B;&#x306B;&#x306F;&#xFF09;&#x3069;&#x3046;&#x3044;&#x3046;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x304C;&#x5FC5;&#x8981;&#x304B;?&#x300D;&#x3092;&#x8003;&#x3048;&#x308B;&#x3002;
</li>
<li>&#x300C;&#x305D;&#x306E;&#x305F;&#x3081;&#x306B;&#x306F;&#x3069;&#x3046;&#x3044;&#x3046;&#x5B9F;&#x9A13;&#x3092;&#x884C;&#x308F;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x304B;?&#x300D;&#x3092;&#x8003;&#x3048;&#x308B;&#x3002;
</li></ol>
<p>&#x3064;&#x307E;&#x308A;&#xFF0C;&#x8AAD;&#x8005;&#x304C;&#x8AAD;&#x3080;&#x306E;&#x3068;&#x9006;&#x306E;&#x9806;&#x5E8F;&#x3067;&#x5185;&#x5BB9;&#x3092;&#x6C7A;&#x3081;&#x308B;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3060;&#x3002;
&#x3053;&#x306E;&#x3088;&#x3046;&#x306A;&#x9806;&#x5E8F;&#x3067;&#x66F8;&#x304F;&#x3068;&#xFF0C;&#x9996;&#x5C3E;&#x4E00;&#x8CAB;&#x3057;&#x305F;&#x6587;&#x66F8;&#x306B;&#x3057;&#x3084;&#x3059;&#x304F;&#x306A;&#x308B;&#x3002;</p><p>&#x307E;&#x305F;&#xFF0C;&#x5B9A;&#x91CF;&#x7684;&#x306B;&#x793A;&#x305B;&#x308B;&#x4E8B;&#x67C4;&#x306F;&#x8AAD;&#x8005;&#x3082;&#x7D0D;&#x5F97;&#x3057;&#x3084;&#x3059;&#x3044;&#x3002;
1.&#x306E;&#x6BB5;&#x968E;&#x3067;&#x306A;&#x308B;&#x3079;&#x304F;&#x5B9A;&#x91CF;&#x7684;&#x306B;&#x793A;&#x305B;&#x308B;&#x4E8B;&#x67C4;&#x3092;&#x9078;&#x3076;&#x3068;&#xFF0C;&#x8AAC;&#x5F97;&#x529B;&#x306E;&#x3042;&#x308B;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x306A;&#x308A;&#x3084;&#x3059;&#x3044;&#x3002;</p><h4 id="&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x4F5C;&#x6210;&#x5B9F;&#x9A13;&#x306E;&#x5834;&#x5408;">&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x4F5C;&#x6210;&#x5B9F;&#x9A13;&#x306E;&#x5834;&#x5408;</h4><p>&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x4F5C;&#x6210;&#x5B9F;&#x9A13;&#x306E;&#x5834;&#x5408;&#xFF0C;&#x300C;&#x5B9F;&#x9A13;&#x65B9;&#x6CD5;&#xFF08;&#x4F55;&#x3092;&#x884C;&#x3063;&#x305F;&#x304B;&#xFF09;&#x300D;&#x306B;&#x66F8;&#x304F;&#x3079;&#x304D;&#x3053;&#x3068;&#x306F;&#x4EE5;&#x4E0B;&#x306E;2&#x9805;&#x76EE;&#x306B;&#x306A;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002;</p><ol><li>&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x8A2D;&#x8A08;&#x3068;&#x5B9F;&#x88C5;
</li>
<li>&#x4F5C;&#x6210;&#x3057;&#x305F;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x884C;&#x3063;&#x305F;&#x5B9F;&#x9A13;&#x3084;&#x52D5;&#x4F5C;&#x30C6;&#x30B9;&#x30C8;
</li></ol>
<p>&#x30D7;&#x30ED;&#x306B;&#x3088;&#x308B;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x958B;&#x767A;&#x3067;&#x3082;&#xFF0C;1.&#x306E;&#x90E8;&#x5206; (forward engineering) &#x3068;&#x540C;&#x3058;&#x304F;&#x3089;&#x3044;&#xFF0C;&#x3042;&#x308B;&#x3044;&#x306F;&#x305D;&#x308C;&#x4EE5;&#x4E0A;&#x306B;&#xFF0C;2.&#x306E;&#x30C6;&#x30B9;&#x30C8;&#x304C;&#x91CD;&#x8981;&#x3060;&#x3068;&#x8A00;&#x308F;&#x308C;&#x308B;&#x3002;
&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x5834;&#x5408;&#x3082;&#xFF0C;2.&#x304C;&#x306A;&#x3044;&#x3068;&#xFF0C;&#x300C;&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#x3092;&#x9054;&#x6210;&#x3067;&#x304D;&#x305F;&#xFF08;&#x4EEE;&#x8AAC;&#x3092;&#x691C;&#x8A3C;&#x3067;&#x304D;&#x305F;&#xFF09;&#x300D;&#x3068;&#x4E3B;&#x5F35;&#x3059;&#x308B;&#x306E;&#x304C;&#x56F0;&#x96E3;&#x3060;&#x3002;</p><p>&#x300C;&#x4F55;&#x3092;&#x3069;&#x308C;&#x3060;&#x3051;&#x66F8;&#x304F;&#x3079;&#x304D;&#x304B;&#x300D;&#x306F;&#x6B21;&#x306E;&#x9805;&#x3067;&#x8FF0;&#x3079;&#x308B;&#x304C;&#xFF0C;&#x305D;&#x308C;&#x3068;&#x3068;&#x3082;&#x306B;&#xFF0C;&#x3082;&#x306E;&#x3092;&#x4F5C;&#x308B;&#x5B9F;&#x9A13;&#x3067;&#x306F;&#x300C;&#x3069;&#x306E;&#x304F;&#x3089;&#x3044;&#x52B4;&#x529B;&#x3092;&#x5272;&#x3044;&#x3066;&#x884C;&#x3063;&#x305F;&#x304B;&#xFF0C;&#x3069;&#x306E;&#x3088;&#x3046;&#x306B;&#x5DE5;&#x592B;&#x3057;&#x305F;&#x304B;&#x300D;&#x3092;&#x8A18;&#x8FF0;&#x3057;&#x3066;&#x52AA;&#x529B;&#x3092;&#x4E3B;&#x5F35;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x5927;&#x4E8B;&#x3060;&#x3002;
&#x3082;&#x3061;&#x308D;&#x3093;&#xFF0C;&#x5358;&#x306B;&#x300C;&#x52AA;&#x529B;&#x3057;&#x305F;&#x300D;&#x300C;&#x304C;&#x3093;&#x3070;&#x3063;&#x305F;&#x300D;&#x3068;&#x66F8;&#x304F;&#x3060;&#x3051;&#x3067;&#x306F;&#x8AAC;&#x5F97;&#x529B;&#x304C;&#x306A;&#x3044;&#x3057;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x500B;&#x4EBA;&#x7684;&#x306A;&#x611F;&#x60F3;&#x306B;&#x904E;&#x304E;&#x306A;&#x3044;&#x3002;
&#x300C;&#x5B9F;&#x969B;&#x306B;&#x884C;&#x3063;&#x305F;&#x4E8B;&#x67C4;&#xFF08;&#x4E8B;&#x5B9F;&#xFF09;&#x3092;&#x8FF0;&#x3079;&#x308B;&#x3053;&#x3068;&#x3067;&#xFF0C;&#x5DE5;&#x592B;&#x3084;&#x52AA;&#x529B;&#x304C;&#x81EA;&#x305A;&#x3068;&#x8AAD;&#x8005;&#x306B;&#x4F1D;&#x308F;&#x308B;&#x300D;&#x3088;&#x3046;&#x306B;&#x66F8;&#x304F;&#x306E;&#x304C;&#x7406;&#x60F3;&#x7684;&#x3060;&#x3002;</p><h3 id="&#x4F55;&#x3092;&#x3069;&#x308C;&#x3060;&#x3051;&#x66F8;&#x304F;&#x3079;&#x304D;&#x304B;">&#x4F55;&#x3092;&#x3069;&#x308C;&#x3060;&#x3051;&#x66F8;&#x304F;&#x3079;&#x304D;&#x304B;</h3><p>&#x300C;&#x5B9F;&#x9A13;&#x65B9;&#x6CD5;&#x300D;&#x300C;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x300D;&#x306B;&#x306F;&#x4E8B;&#x5B9F;&#x3092;&#x7387;&#x76F4;&#x306B;&#x66F8;&#x3051;&#x3070;&#x3088;&#x3044;&#x306E;&#x3060;&#x304C;&#xFF0C;&#x60C5;&#x5831;&#x304C;&#x4E0D;&#x8DB3;&#x3057;&#x3066;&#x3044;&#x3066;&#x3082;&#x3044;&#x3051;&#x306A;&#x3044;&#x3057;&#xFF0C;&#x5197;&#x9577;&#x904E;&#x304E;&#x3066;&#x3082;&#x7406;&#x89E3;&#x3057;&#x306B;&#x304F;&#x304F;&#x306A;&#x308B;&#x3002;
&#x5FC5;&#x8981;&#x304B;&#x3064;&#x5341;&#x5206;&#x306A;&#x60C5;&#x5831;&#x3092;&#x8A18;&#x8FF0;&#x3057;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;
&#x5FC5;&#x8981;&#x306A;&#x60C5;&#x5831;&#x304B;&#x3069;&#x3046;&#x304B;&#x3092;&#x3069;&#x3046;&#x5224;&#x65AD;&#x3059;&#x308C;&#x3070;&#x3088;&#x3044;&#x3060;&#x308D;&#x3046;&#x304B;?&#x3000;
&#x305D;&#x306E;&#x57FA;&#x6E96;&#x306F;&#xFF0C;&#x300C;&#x8AAD;&#x8005;&#x304C;&#x540C;&#x3058;&#x5B9F;&#x9A13;&#x30FB;&#x540C;&#x3058;&#x7D50;&#x679C;&#x3092;&#x518D;&#x73FE;&#x3067;&#x304D;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x300D;&#xFF0C;
&#x8A00;&#x3044;&#x63DB;&#x3048;&#x308B;&#x3068;&#x300C;&#x8A18;&#x8FF0;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x4E8B;&#x67C4;&#x3092;&#x8AAD;&#x8005;&#x304C;&#x78BA;&#x8A8D;&#x3057;&#x3088;&#x3046;&#x3068;&#x601D;&#x3048;&#x3070;&#x78BA;&#x8A8D;&#x3067;&#x304D;&#x308B;&#x300D;&#x3053;&#x3068;&#xFF0C;&#x3068;&#x8003;&#x3048;&#x308C;&#x3070;&#x3088;&#x3044;&#x3002;</p><p>&#x4F8B;&#x3048;&#x3070;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x8A2D;&#x8A08;&#x4ED5;&#x69D8;&#x306E;&#x7BC0;&#x3067;&#x306F;&#xFF0C;
&#x300C;&#x305D;&#x306E;&#x60C5;&#x5831;&#x306B;&#x5F93;&#x3063;&#x3066;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3059;&#x308C;&#x3070;&#xFF0C;&#x81EA;&#x305A;&#x3068;&#x307B;&#x307C;&#x540C;&#x3058;&#x3082;&#x306E;&#x304C;&#x51FA;&#x6765;&#x4E0A;&#x304C;&#x308B;&#x300D;
&#x3042;&#x308B;&#x3044;&#x306F;
&#x300C;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x898B;&#x306A;&#x304F;&#x3066;&#x3082;&#xFF0C;&#x3069;&#x3046;&#x3044;&#x3046;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306B;&#x306A;&#x308B;&#x304B;&#x8AAD;&#x8005;&#x306E;&#x76EE;&#x306B;&#x6D6E;&#x304B;&#x3076;&#x300D;
&#x3088;&#x3046;&#x306B;&#x66F8;&#x304F;&#x306E;&#x304C;&#x7406;&#x60F3;&#x7684;&#x3060;&#x3002;
&#x307E;&#x305F;&#xFF0C;&#x8A2D;&#x8A08;&#x5224;&#x65AD;&#xFF08;&#x8003;&#x3048;&#x3089;&#x308C;&#x308B;&#x9078;&#x629E;&#x80A2;&#x306E;&#x4E2D;&#x304B;&#x3089;&#x4F55;&#x3092;&#x9078;&#x3093;&#x3060;&#x304B;&#xFF09;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x306A;&#x308B;&#x3079;&#x304F;&#x3082;&#x308C;&#x306A;&#x304F;&#x66F8;&#x304D;&#xFF0C;
&#x306A;&#x305C;&#x305D;&#x308C;&#x3092;&#x9078;&#x3093;&#x3060;&#x306E;&#x304B;&#x7406;&#x7531;&#x3082;&#x8AAC;&#x660E;&#x3059;&#x308B;&#x3068;&#x306A;&#x304A;&#x3088;&#x3044;&#x3002;</p><p>&#x5B9F;&#x9A13;&#x65B9;&#x6CD5;&#x306E;&#x7BC0;&#x3067;&#x306F;&#xFF0C;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x306B;&#x5F71;&#x97FF;&#x3092;&#x4E0E;&#x3048;&#x308B;&#x60C5;&#x5831;&#x3092;&#x3067;&#x304D;&#x308B;&#x3060;&#x3051;&#x3082;&#x3089;&#x3055;&#x305A;&#x66F8;&#x304F;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;
&#x4F8B;&#x3048;&#x3070;&#xFF0C;&#x5B9F;&#x884C;&#x6642;&#x9593;&#x3092;&#x6E2C;&#x5B9A;&#x3059;&#x308B;&#x5834;&#x5408;&#xFF0C;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x30CF;&#x30FC;&#x30C9;&#x30A6;&#x30A7;&#x30A2;
&#xFF08;&#x7279;&#x306B;CPU&#x306E;&#x7A2E;&#x985E;&#xFF0C;&#x30AF;&#x30ED;&#x30C3;&#x30AF;&#x5468;&#x6CE2;&#x6570;&#xFF0C;RAM&#x5BB9;&#x91CF;&#xFF09;&#x306F;&#x660E;&#x3089;&#x304B;&#x306B;&#x7D50;&#x679C;&#x306B;&#x5F71;&#x97FF;&#x3059;&#x308B;&#x3002;
OS&#x3084;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30E9;&#x3084;&#x5B9F;&#x884C;&#x6642;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x306A;&#x3069;&#x306E;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x3082;&#x5F71;&#x97FF;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3042;&#x308B;&#x3002;
&#x6E2C;&#x5B9A;&#x624B;&#x6BB5;&#x3068;&#x3057;&#x3066;&#x4F7F;&#x3063;&#x305F;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x3084;&#xFF0C;&#x4F55;&#x56DE;&#x304B;&#x6E2C;&#x5B9A;&#x3057;&#x3066;&#x5E73;&#x5747;&#x3057;&#x305F;&#x306E;&#x304B;&#x3069;&#x3046;&#x304B;&#x306A;&#x3069;&#x3082;&#xFF0C;&#x8AAD;&#x8005;&#x304C;&#x540C;&#x3058;&#x7D50;&#x679C;&#x3092;&#x518D;&#x73FE;&#x3059;&#x308B;&#x306E;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x60C5;&#x5831;&#x3068;&#x8003;&#x3048;&#x3089;&#x308C;&#x308B;&#x3002;</p><p>&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#xFF0C;&#x5BA2;&#x89B3;&#x7684;&#x306A;&#x4E8B;&#x5B9F;&#x3092;&#x66F8;&#x304F;&#x3088;&#x3046;&#x6C17;&#x3092;&#x3064;&#x3051;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;
&#x4F8B;&#x3048;&#x3070;&#x300C;&#x901F;&#x3044;&#x300D;&#x300C;&#x5927;&#x304D;&#x3044;&#x300D;&#x306A;&#x3069;&#x306F;&#xFF0C;&#x5224;&#x65AD;&#x306E;&#x7D50;&#x679C;&#x3067;&#x3042;&#x3063;&#x3066;&#xFF0C;&#x4E8B;&#x5B9F;&#x3068;&#x306F;&#x8A00;&#x3048;&#x306A;&#x3044;&#x3002;
&#x3067;&#x304D;&#x308B;&#x3060;&#x3051;&#xFF0C;&#x6E2C;&#x5B9A;&#x3057;&#x305F;&#x6570;&#x91CF;&#x305D;&#x306E;&#x3082;&#x306E;&#x3092;&#x793A;&#x3059;&#x3079;&#x304D;&#x3067;&#x3042;&#x308B;&#x3002;</p><h4 id="&#x60F3;&#x5B9A;&#x3059;&#x3079;&#x304D;&#x8AAD;&#x8005;">&#x60F3;&#x5B9A;&#x3059;&#x3079;&#x304D;&#x8AAD;&#x8005;</h4><p>&#x300C;&#x8AAD;&#x8005;&#x304C;&#x540C;&#x3058;&#x7D50;&#x679C;&#x3092;&#x518D;&#x73FE;&#x3067;&#x304D;&#x308B;&#x300D;&#x3088;&#x3046;&#x306B;&#x66F8;&#x304F;&#x3079;&#x304D;&#x3060;&#x304C;&#xFF0C;&#x305D;&#x306E;&#x300C;&#x8AAD;&#x8005;&#x300D;&#x306F;&#xFF0C;
&#x300C;&#x60C5;&#x5831;&#x79D1;&#x5B66;&#x306E;&#x77E5;&#x8B58;&#x306F;&#x3042;&#x308B;&#x304C;&#xFF0C;<strong>&#x672C;&#x79D1;&#x76EE;&#x56FA;&#x6709;&#x306E;&#x3053;&#x3068;&#x306F;&#x77E5;&#x3089;&#x306A;&#x3044;</strong>
&#xFF08;&#x8AB2;&#x984C;&#x6587;&#x3082;&#x5B9F;&#x9A13;&#x6307;&#x5C0E;&#x66F8;&#x3082;&#x8AAD;&#x3093;&#x3067;&#x3044;&#x306A;&#x3044;&#xFF09;&#x300D;&#x3088;&#x3046;&#x306A;&#x4EBA;&#x3005;&#x3092;&#x60F3;&#x5B9A;&#x3059;&#x3079;&#x304D;&#x3067;&#x3042;&#x308B;&#x3002;
&#x4F8B;&#x3048;&#x3070;&#x300C;10&#x5E74;&#x5F8C;&#x306E;&#x8AAD;&#x8005;&#x304C;&#x8AAD;&#x3093;&#x3067;&#x3082;&#x7406;&#x89E3;&#x3067;&#x304D;&#x308B;&#x300D;&#x3088;&#x3046;&#x306B;&#x66F8;&#x304F;&#xFF0C;&#x3068;&#x8003;&#x3048;&#x308B;&#x3068;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x304B;&#x3082;&#x77E5;&#x308C;&#x306A;&#x3044;&#x3002;</p><h3 id="&#x300C;&#x8003;&#x5BDF;&#x300D;&#x306F;&#x500B;&#x4EBA;&#x7684;&#x610F;&#x898B;&#x3084;&#x611F;&#x60F3;&#x3067;&#x306F;&#x306A;&#x3044;">&#x300C;&#x8003;&#x5BDF;&#x300D;&#x306F;&#x500B;&#x4EBA;&#x7684;&#x610F;&#x898B;&#x3084;&#x611F;&#x60F3;&#x3067;&#x306F;&#x306A;&#x3044;</h3><p>&#x300C;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x300D;&#x306B;&#x306F;&#x89B3;&#x6E2C;&#x3055;&#x308C;&#x305F;&#x4E8B;&#x5B9F;&#x3092;&#x66F8;&#x304D;&#xFF0C;&#x300C;&#x8003;&#x5BDF;&#x300D;&#x306B;&#x306F;&#x4E8B;&#x5B9F;&#x304B;&#x3089;&#x63A8;&#x8AD6;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x3092;&#x66F8;&#x304F;&#x3002;
&#x305F;&#x3060;&#x3057;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x500B;&#x4EBA;&#x7684;&#x306A;&#x610F;&#x898B;&#x3084;&#x611F;&#x60F3;&#x3067;&#x306F;&#x306A;&#x304F;&#xFF0C;&#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x4EBA;&#x304C;&#x540C;&#x3058;&#x7D50;&#x8AD6;&#x306B;&#x81F3;&#x308B;&#x3068;&#x8003;&#x3048;&#x3089;&#x308C;&#x308B;&#x3088;&#x3046;&#x306A;&#xFF0C;&#x5BA2;&#x89B3;&#x7684;&#x306A;&#x63A8;&#x8AD6;&#x3067;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;
&#x4F8B;&#x3048;&#x3070;&#x300C;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x304B;&#x3089;&#xFF0C;&#x25CB;&#x25CB;&#x3067;&#x3042;&#x308B;&#x3068;&#x8A00;&#x3048;&#x308B;&#x3002;&#x300D;&#x3068;&#x66F8;&#x304F;&#x5834;&#x5408;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x81EA;&#x5206;&#x306E;&#x500B;&#x4EBA;&#x7684;&#x306A;&#x610F;&#x898B;&#x3067;&#x306F;&#x306A;&#x304F;&#xFF0C;
&#x300C;&#x8AB0;&#x304C;&#x898B;&#x3066;&#x3082;&#x3053;&#x3046;&#x8A00;&#x3046;&#x3067;&#x3057;&#x3087;&#x3046;&#x300D;&#x3068;&#x601D;&#x3048;&#x308B;&#x3082;&#x306E;&#x306E;&#x307F;&#x66F8;&#x304B;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;
&#x9006;&#x306B;&#x8A00;&#x3048;&#x3070;&#xFF0C;&#x300C;&#x8AB0;&#x304C;&#x898B;&#x3066;&#x3082;&#x3053;&#x3046;&#x8A00;&#x3046;&#x300D;&#x3068;&#x601D;&#x3048;&#x308B;&#x304F;&#x3089;&#x3044;&#x306E;&#x6750;&#x6599;&#xFF08;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#xFF09;&#x304C;&#x5FC5;&#x8981;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3082;&#x3042;&#x308B;&#x3002;</p><p>&#x307E;&#x305F;&#xFF0C;&#x300C;&#x8003;&#x5BDF;&#x300D;&#x3092;&#x66F8;&#x304F;&#x969B;&#x306B;&#x5927;&#x4E8B;&#x306A;&#x3053;&#x3068;&#x306F;&#xFF0C;
&#x300C;&#x308F;&#x304B;&#x3063;&#x305F;&#x3053;&#x3068;&#x3068;&#x307E;&#x3060;&#x4E0D;&#x660E;&#x306A;&#x3053;&#x3068;&#x3092;&#x306F;&#x3063;&#x304D;&#x308A;&#x533A;&#x5225;&#x3059;&#x308B;&#x300D;&#x3053;&#x3068;&#x3060;&#x3002;
&#x5B9F;&#x306F;&#xFF0C;&#x300C;&#x305D;&#x306E;&#x5B9F;&#x9A13;&#x3067;&#x4F55;&#x304C;&#x78BA;&#x304B;&#x3081;&#x3089;&#x308C;&#x308B;&#x306E;&#x304B;?&#x300D;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x300C;&#x4F55;&#x306F;&#x78BA;&#x304B;&#x3081;&#x3089;&#x308C;&#x306A;&#x3044;&#x306E;&#x304B;?&#x300D;
&#x3092;&#x7406;&#x89E3;&#x3059;&#x308B;&#x3053;&#x3068;&#x306F;&#x91CD;&#x8981;&#x3067;&#x3042;&#x308A;&#xFF0C;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x8A55;&#x4FA1;&#x3059;&#x308B;&#x969B;&#x306B;&#x6CE8;&#x76EE;&#x3059;&#x308B;&#x70B9;&#x3067;&#x3082;&#x3042;&#x308B;&#x3002;
&#x300C;&#x4F55;&#x306F;&#x8A00;&#x3048;&#x3066;&#x4F55;&#x306F;&#x8A00;&#x3048;&#x306A;&#x3044;&#x304B;?&#x300D;&#x300C;&#x305D;&#x306E;&#x4E0D;&#x660E;&#x70B9;&#x3092;&#x660E;&#x3089;&#x304B;&#x306B;&#x3059;&#x308B;&#x306B;&#x306F;&#x4F55;&#x3092;&#x884C;&#x3048;&#x3070;&#x3088;&#x3044;&#x306E;&#x304B;?&#x300D;
&#x306A;&#x3069;&#x3092;&#x8003;&#x5BDF;&#x3068;&#x3057;&#x3066;&#x66F8;&#x304F;&#x3068;&#xFF0C;&#x8A55;&#x4FA1;&#x304C;&#x9AD8;&#x304F;&#x306A;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002;</p><h3 id="&#x53C2;&#x8003;&#x6587;&#x732E;&#x3068;&#x5F15;&#x7528;">&#x53C2;&#x8003;&#x6587;&#x732E;&#x3068;&#x5F15;&#x7528;</h3><p>&#x9069;&#x5207;&#x306A;&#x53C2;&#x8003;&#x6587;&#x732E;&#x3092;&#x6319;&#x3052;&#xFF0C;&#x305D;&#x308C;&#x3089;&#x3092;&#x9069;&#x5207;&#x306B;&#x5F15;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x306F;&#xFF0C;&#x4EE5;&#x4E0B;&#x306E;&#x610F;&#x5473;&#x3067;&#x5927;&#x4E8B;&#x3067;&#x3042;&#x308B;&#x3002;</p><ol><li>&#x8CC7;&#x6599;&#x3084;&#x6587;&#x732E;&#x304B;&#x3089;&#x8A18;&#x8FF0;&#x5185;&#x5BB9;&#x3084;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x5F15;&#x7528;&#x3059;&#x308B;&#x969B;&#xFF0C;&#x5F15;&#x7528;&#x5143;&#x3092;&#x660E;&#x793A;&#x305B;&#x305A;&#x306B;&#x884C;&#x3046;&#x306E;&#x306F;&#x76D7;&#x7528;&#x30FB;&#x527D;&#x7A83;&#x306B;&#x5F53;&#x305F;&#x308B;&#x3002;
</li>
<li>&#x8CC7;&#x6599;&#x3084;&#x6587;&#x732E;&#x306E;&#x8A18;&#x8FF0;&#x3092;&#x5F15;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#xFF0C;&#x300C;&#x81EA;&#x5206;&#x52DD;&#x624B;&#x306A;&#x610F;&#x898B;&#x3067;&#x306F;&#x306A;&#x304F;&#xFF0C;&#x88CF;&#x4ED8;&#x3051;&#x304C;&#x3042;&#x308B;&#x300D;&#x3053;&#x3068;&#x3092;&#x4E3B;&#x5F35;&#x3067;&#x304D;&#x308B;&#x3002;
</li>
<li>&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3084;&#x8AD6;&#x6587;&#x306B;&#x66F8;&#x304F;&#x7269;&#x4E8B;&#x306B;&#x3064;&#x3044;&#x3066;&#xFF0C;&#x4E00;&#x3005;&#x8CC7;&#x6599;&#x3092;&#x8ABF;&#x3079;&#x88CF;&#x4ED8;&#x3051;&#x3092;&#x53D6;&#x308B;&#x3053;&#x3068;&#x306F;&#xFF0C;&#x7814;&#x7A76;&#x8005;&#x30FB;&#x6280;&#x8853;&#x8005;&#x3068;&#x3057;&#x3066;&#x671B;&#x307E;&#x3057;&#x3044;&#x614B;&#x5EA6;&#x3067;&#x3042;&#x308B;&#x3002;
&#x5F15;&#x7528;&#x306B;&#x3088;&#x308A;&#xFF0C;&#x305D;&#x306E;&#x3088;&#x3046;&#x306A;&#x614B;&#x5EA6;&#x3067;&#x53D6;&#x308A;&#x7D44;&#x3093;&#x3067;&#x3044;&#x308B;&#x3053;&#x3068;&#x3092;&#x793A;&#x305B;&#x308B;&#x3002;
</li>
<li>&#x300C;&#x8AAD;&#x8005;&#x306E;&#x5168;&#x54E1;&#x304C;&#x77E5;&#x3063;&#x3066;&#x3044;&#x308B;&#x3068;&#x306F;&#x8A00;&#x3048;&#x306A;&#x3044;&#x304C;&#xFF0C;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3084;&#x8AD6;&#x6587;&#x306E;&#x672C;&#x984C;&#x304B;&#x3089;&#x5916;&#x308C;&#x308B;&#x306E;&#x3067;&#x8AAC;&#x660E;&#x306F;&#x7701;&#x7565;&#x3057;&#x305F;&#x3044;&#x300D;&#x3068;&#x3044;&#x3046;&#x5834;&#x5408;&#x306B;&#xFF0C;&#x8AAD;&#x8005;&#x304C;&#x81EA;&#x5206;&#x3067;&#x8ABF;&#x3079;&#x308B;&#x305F;&#x3081;&#x306E;&#x60C5;&#x5831;&#x3092;&#x63D0;&#x4F9B;&#x3067;&#x304D;&#x308B;
&#xFF08;&#x305F;&#x3060;&#x3057;&#xFF0C;&#x300C;&#x305D;&#x308C;&#x3092;&#x77E5;&#x3089;&#x306A;&#x3044;&#x3068;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3084;&#x8AD6;&#x6587;&#x306E;&#x5185;&#x5BB9;&#x3092;&#x7406;&#x89E3;&#x3067;&#x304D;&#x306A;&#x3044;&#x300D;&#x3088;&#x3046;&#x306A;&#x4E8B;&#x67C4;&#x306F;&#xFF0C;
&#x305D;&#x306E;&#x6587;&#x66F8;&#x306E;&#x4E2D;&#x3067;&#x8AAC;&#x660E;&#x3059;&#x3079;&#x304D;&#x3067;&#x3042;&#x308B;&#xFF09;&#x3002;
</li></ol>
<p>&#x306A;&#x304A;&#xFF0C;&#x672C;&#x6587;&#x4E2D;&#x3067;&#x89E6;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x6587;&#x732E;&#x3092;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x672B;&#x306E;&#x6587;&#x732E;&#x30EA;&#x30B9;&#x30C8;&#x306B;&#x63B2;&#x8F09;&#x3059;&#x308B;&#x306E;&#x306F;&#x60AA;&#x3044;&#x4F5C;&#x6CD5;&#x3060;
&#xFF08;&#x672C;&#x6587;&#x4E2D;&#x306E;&#x3069;&#x306E;&#x4E8B;&#x67C4;&#x3068;&#x95A2;&#x9023;&#x3059;&#x308B;&#x6587;&#x732E;&#x306A;&#x306E;&#x304B;&#x308F;&#x304B;&#x3089;&#x306A;&#x3044;&#x304B;&#x3089;&#xFF09;&#x3002;</p><h2 id="&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x4F53;&#x88C1;">&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x4F53;&#x88C1;</h2><p>&#x81EA;&#x5206;&#x5C02;&#x7528;&#x306E;&#x30E1;&#x30E2;&#x3067;&#x3082;&#x306A;&#x3044;&#x9650;&#x308A;&#xFF0C;&#x5185;&#x5BB9;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x4F53;&#x88C1;&#x3082;&#x6C17;&#x3092;&#x914D;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;
&#x307E;&#x305F;&#xFF0C;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3084;&#x5B66;&#x4F4D;&#x8AD6;&#x6587;&#x306E;&#x3088;&#x3046;&#x306B;&#xFF0C;&#x591A;&#x304F;&#x306E;&#x6587;&#x66F8;&#x304C;&#x540C;&#x6642;&#x306B;&#x63D0;&#x51FA;&#x3055;&#x308C;&#x308B;&#x5834;&#x5408;&#xFF0C;
&#x4F53;&#x88C1;&#x304C;&#x7D71;&#x4E00;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x3068;&#x8AAD;&#x8005;&#x306B;&#x3068;&#x3063;&#x3066;&#x8AAD;&#x307F;&#x3065;&#x3089;&#x3044;&#x3002;
&#x3042;&#x308B;&#x3044;&#x306F;&#x5B66;&#x4F1A;&#x306E;&#x96D1;&#x8A8C;&#x7B49;&#x306B;&#x8AD6;&#x6587;&#x3092;&#x6295;&#x7A3F;&#x3059;&#x308B;&#x969B;&#x3082;&#xFF0C;&#x901A;&#x5E38;&#x306F;&#x305D;&#x306E;&#x96D1;&#x8A8C;&#x7279;&#x6709;&#x306E;&#x4F53;&#x88C1;&#x304C;&#x6C7A;&#x307E;&#x3063;&#x3066;&#x304A;&#x308A;&#xFF0C;
&#x305D;&#x308C;&#x306B;&#x5F93;&#x3046;&#x3053;&#x3068;&#x304C;&#x8981;&#x6C42;&#x3055;&#x308C;&#x308B;&#x3002;
&#x7528;&#x7D19;&#x306E;&#x5927;&#x304D;&#x3055;&#xFF0C;&#x6A19;&#x984C;&#x3084;&#x8457;&#x8005;&#x540D;&#x7B49;&#x3092;&#x66F8;&#x304F;&#x4F4D;&#x7F6E;&#xFF0C;&#x7DB4;&#x3058;&#x308B;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E00;&#x6BB5;&#x7D44;&#x304B;&#x4E8C;&#x6BB5;&#x7D44;&#x304B;&#xFF0C;&#x4F59;&#x767D;&#x306E;&#x5927;&#x304D;&#x3055;&#xFF0C;
&#x6587;&#x5B57;&#x306E;&#x5927;&#x304D;&#x3055;&#xFF0C;&#x884C;&#x9593;&#x306E;&#x9577;&#x3055;&#xFF0C;&#x30D5;&#x30A9;&#x30F3;&#x30C8;&#xFF08;&#x66F8;&#x4F53;&#xFF09;&#x306A;&#x3069;&#x306B;&#x3064;&#x3044;&#x3066;&#xFF0C;
&#x8AAD;&#x8005;&#x306B;&#x3068;&#x3063;&#x3066;&#x8AAD;&#x307F;&#x3084;&#x3059;&#x3044;&#x304B;&#xFF0C;&#x307E;&#x305F;&#x4F53;&#x88C1;&#x306B;&#x95A2;&#x3059;&#x308B;&#x30EB;&#x30FC;&#x30EB;&#x304C;&#x3042;&#x308B;&#x5834;&#x5408;&#x306F;&#x305D;&#x308C;&#x306B;&#x5F93;&#x3063;&#x3066;&#x3044;&#x308B;&#x304B;&#xFF0C;&#x6CE8;&#x610F;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;</p><ul><li>&#x53C2;&#x8003;&#xFF1A;&#x4F53;&#x88C1;&#x306B;&#x95A2;&#x3059;&#x308B;&#x53C2;&#x8003;&#x66F8;&#x3068;&#x3057;&#x3066;&#x4E0B;&#x8A18;&#x304C;&#x3042;&#x308B;&#x3002;&#x66F8;&#x4F53;&#x3084;&#x884C;&#x9593;&#x3084;&#x305D;&#x306E;&#x4ED6;&#x306E;&#x4F53;&#x88C1;&#x306B;&#x95A2;&#x3057;&#x3066;&#xFF0C;&#x8AAD;&#x307F;&#x3084;&#x3059;&#x304F;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x69D8;&#x3005;&#x306A;&#x30EB;&#x30FC;&#x30EB;&#x3092;&#x7D39;&#x4ECB;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;
<ul><li>&#x9AD8;&#x6A4B;&#x4F51;&#x78E8;&#x30FB;&#x7247;&#x5C71;&#x306A;&#x3064;&#x8457;
&#x300E;&#x4F1D;&#x308F;&#x308B;&#x30C7;&#x30B6;&#x30A4;&#x30F3;&#x306E;&#x57FA;&#x672C; --- &#x3088;&#x3044;&#x8CC7;&#x6599;&#x3092;&#x4F5C;&#x308B;&#x305F;&#x3081;&#x306E;&#x30EC;&#x30A4;&#x30A2;&#x30A6;&#x30C8;&#x306E;&#x30EB;&#x30FC;&#x30EB;&#x300F;&#x6280;&#x8853;&#x8A55;&#x8AD6;&#x793E;, 2014.
</li></ul>
</li></ul>
<p>&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3067;&#x306F;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;&#x4F53;&#x88C1;&#x3092;&#x8981;&#x6C42;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x304C;&#x591A;&#x3044;&#x304C;&#xFF0C;&#x79D1;&#x76EE;&#x306B;&#x3088;&#x3063;&#x3066;&#x3061;&#x304C;&#x3046;&#x4F53;&#x88C1;&#x304C;&#x8981;&#x6C42;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x3082;&#x3042;&#x308B;&#x306E;&#x3067;&#xFF0C;&#x79D1;&#x76EE;&#x3054;&#x3068;&#x306B;&#x6307;&#x793A;&#x306B;&#x5F93;&#x3046;&#x3053;&#x3068;&#x3002;</p><ul><li>&#x6A19;&#x984C;&#xFF0C;&#x79D1;&#x76EE;&#x540D;&#xFF0C;&#x5B66;&#x7C4D;&#x756A;&#x53F7;&#xFF0C;&#x8457;&#x8005;&#x540D;&#xFF0C;&#x63D0;&#x51FA;&#x65E5;&#x3092;&#x8868;&#x7D19;&#x306B;&#x8AA4;&#x308A;&#x306A;&#x304F;&#x8A18;&#x8FF0;&#x3059;&#x308B;&#x3002;
</li>
<li>A4&#x7528;&#x7D19;&#x306B;&#x5370;&#x5237;&#x3057;&#xFF0C;2&#x679A;&#x4EE5;&#x4E0A;&#x306E;&#x5834;&#x5408;&#x306F;&#x7528;&#x7D19;&#x306E;&#x5DE6;&#x4E0A;&#x4E00;&#x7B87;&#x6240;&#x3092;&#x30B9;&#x30C6;&#x30FC;&#x30D7;&#x30E9;&#x3067;&#x7DB4;&#x3058;&#x308B;&#xFF08;&#x7D19;&#x3067;&#x63D0;&#x51FA;&#x3059;&#x308B;&#x5834;&#x5408;&#xFF09;&#x3002;
</li>
<li>&#x53E5;&#x8AAD;&#x70B9;&#x306F;&#x30B3;&#x30F3;&#x30DE;&#x3068;&#x30D4;&#x30EA;&#x30AA;&#x30C9;&#xFF08;&#x300C;&#xFF0C;&#x300D;&#x300C;&#xFF0E;&#x300D;&#xFF09;&#x3092;&#x4F7F;&#x3046;&#x3002;
&#x5168;&#x89D2;&#x30B3;&#x30F3;&#x30DE;&#xFF0C;&#x5168;&#x89D2;&#x30D4;&#x30EA;&#x30AA;&#x30C9;&#x3092;&#x63A8;&#x5968;&#x3059;&#x308B;&#x3002;
</li>
<li>&#x53C2;&#x8003;&#x6587;&#x732E;&#x306E;&#x66F8;&#x8A8C;&#x60C5;&#x5831;&#x306E;&#x8A18;&#x6CD5;&#x306F;&#x6307;&#x5B9A;&#x306E;&#x30B9;&#x30BF;&#x30A4;&#x30EB;&#x306B;&#x5F93;&#x3046;
&#xFF08;&#x5B66;&#x4F1A;&#x3084;&#x63B2;&#x8F09;&#x8A8C;&#x3054;&#x3068;&#x306B;&#x30B9;&#x30BF;&#x30A4;&#x30EB;&#x304C;&#x3061;&#x304C;&#x3046;&#x304C;&#xFF0C;&#x66F8;&#x304F;&#x3079;&#x304D;&#x60C5;&#x5831;&#x306F;&#x6982;&#x306D;&#x540C;&#x3058;&#xFF09;&#x3002;
<ul><li>&#x53C2;&#x8003;&#xFF1A;<a href="http://www.ieice.org/jpn/shiori/iss_2.html#2.6" target="_blank">&#x300E;&#x96FB;&#x5B50;&#x60C5;&#x5831;&#x901A;&#x4FE1;&#x5B66;&#x4F1A;&#x548C;&#x6587;&#x8AD6;&#x6587;&#x8A8C; &#x6295;&#x7A3F;&#x306E;&#x3057;&#x304A;&#x308A;&#xFF08;&#x60C5;&#x5831;&#x30FB;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30BD;&#x30B5;&#x30A4;&#x30A8;&#x30C6;&#x30A3;&#xFF09;&#x300F;2.6&#x7BC0;&#x300C;&#x6587;&#x732E;&#x300D;</a>
</li></ul>
</li></ul>
<h2 id="&#x7D30;&#x90E8;&#x306E;&#x8A70;&#x3081;&#x304C;&#x5370;&#x8C61;&#x3092;&#x5DE6;&#x53F3;&#x3059;&#x308B;">&#x7D30;&#x90E8;&#x306E;&#x8A70;&#x3081;&#x304C;&#x5370;&#x8C61;&#x3092;&#x5DE6;&#x53F3;&#x3059;&#x308B;</h2><p>&#x8AAD;&#x3093;&#x3067;&#x3044;&#x308B;&#x8CC7;&#x6599;&#x3084;&#x6587;&#x732E;&#x306B;&#x8AA4;&#x5B57;&#x30FB;&#x8131;&#x5B57;&#x304C;&#x6563;&#x898B;&#x3055;&#x308C;&#x305F;&#x3089;&#xFF0C;&#x8AF8;&#x541B;&#x306F;&#x3069;&#x3046;&#x611F;&#x3058;&#x308B;&#x3060;&#x308D;&#x3046;&#x304B;&#x3002;
&#x8AA4;&#x5B57;&#x30FB;&#x8131;&#x5B57;&#x3068;&#x3044;&#x3046;&#x300C;&#x96D1;&#x97F3;&#x300D;&#x304C;&#x3042;&#x308B;&#x5206;&#xFF0C;&#x30B9;&#x30E0;&#x30FC;&#x30BA;&#x306B;&#x8AAD;&#x3081;&#x306A;&#x304F;&#x306A;&#x308B;&#x3060;&#x308D;&#x3046;&#x3057;&#xFF0C;&#x3055;&#x3089;&#x306B;&#x306F;
&#x300C;&#x3042;&#x307E;&#x308A;&#x614E;&#x91CD;&#x306B;&#x66F8;&#x304B;&#x308C;&#x3066;&#x304A;&#x3089;&#x305A;&#xFF0C;&#x4E2D;&#x8EAB;&#x304C;&#x4FE1;&#x983C;&#x3067;&#x304D;&#x306A;&#x3044;&#x306E;&#x3067;&#x306F;&#x306A;&#x3044;&#x304B;&#x300D;&#x3068;&#x3044;&#x3046;&#x5370;&#x8C61;&#x3082;&#x53D7;&#x3051;&#x308B;&#x304B;&#x3082;&#x77E5;&#x308C;&#x306A;&#x3044;&#x3002;
&#x8AAD;&#x307F;&#x624B;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x8AA0;&#x610F;&#x304C;&#x6B20;&#x3051;&#x3066;&#x3044;&#x308B;&#x3068;&#x611F;&#x3058;&#xFF0C;&#x3088;&#x307B;&#x3069;&#x5FC5;&#x8981;&#x3067;&#x306A;&#x3051;&#x308C;&#x3070;&#x8AAD;&#x3080;&#x6C17;&#x3092;&#x5931;&#x3046;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3082;&#x3042;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002;
&#x6587;&#x66F8;&#x306B;&#x66F8;&#x304F;&#x4E2D;&#x8EAB;&#xFF0C;&#x8AAC;&#x660E;&#x3059;&#x308B;&#x5185;&#x5BB9;&#x306B;&#x6BD4;&#x3079;&#x3066;&#xFF0C;&#x8AA4;&#x5B57;&#x30FB;&#x8131;&#x5B57;&#x7B49;&#x306F;&#x7463;&#x672B;&#x306A;&#x4E8B;&#x67C4;&#x3067;&#x306F;&#x3042;&#x308B;&#x304C;&#xFF0C;
&#x304A;&#x308D;&#x305D;&#x304B;&#x306B;&#x3057;&#x3066;&#x306F;&#x5168;&#x4F53;&#x306E;&#x51FA;&#x6765;&#x6620;&#x3048;&#x3092;&#x53F0;&#x7121;&#x3057;&#x306B;&#x3059;&#x308B;&#x3002;</p><p>&#x540C;&#x69D8;&#x306B;&#xFF0C;&#x8AD6;&#x6587;&#x3084;&#x6280;&#x8853;&#x6587;&#x66F8;&#x306B;&#x3075;&#x3055;&#x308F;&#x3057;&#x3044;&#x6587;&#x4F53;&#x304B;&#x3069;&#x3046;&#x304B;&#x3082;&#x6CE8;&#x610F;&#x3059;&#x3079;&#x304D;&#x70B9;&#x3060;&#x3002;
&#x4EE5;&#x4E0B;&#x306E;2&#x3064;&#x306E;&#x6587;&#x7AE0;&#x3092;&#x8AAD;&#x3093;&#x3060;&#x3068;&#x304D;&#xFF0C;&#x3069;&#x3061;&#x3089;&#x304C;&#x4FE1;&#x983C;&#x3067;&#x304D;&#x305D;&#x3046;&#x306B;&#x611F;&#x3058;&#x308B;&#x3060;&#x308D;&#x3046;&#x304B;?</p><ul><li>&#x300C;&#x65B9;&#x6CD5;A&#x3067;&#x3084;&#x3063;&#x305F;&#x65B9;&#x304C;B&#x3088;&#x308A;&#x3059;&#x3054;&#x3044;&#x901F;&#x304B;&#x3063;&#x305F;&#xFF0E;&#x300D;
</li>
<li>&#x300C;&#x65B9;&#x6CD5;A&#x3092;&#x7528;&#x3044;&#x305F;&#x65B9;&#x304C;&#xFF0C;B&#x3092;&#x7528;&#x3044;&#x305F;&#x3068;&#x304D;&#x3088;&#x308A;&#x7D04;1.8&#x500D;&#x901F;&#x304B;&#x3063;&#x305F;&#xFF0E;&#x300D;
</li></ul>
<h2 id="&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x6587;&#x7AE0;&#xFF0C;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x8AAC;&#x660E;">&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x6587;&#x7AE0;&#xFF0C;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x8AAC;&#x660E;</h2><p>&#x8A00;&#x3046;&#x307E;&#x3067;&#x3082;&#x306A;&#x3044;&#x3053;&#x3068;&#x3060;&#x304C;&#xFF0C;&#x4EE5;&#x4E0B;&#x306E;&#x4E8B;&#x67C4;&#x306F;&#x3069;&#x306E;&#x3088;&#x3046;&#x306A;&#x6587;&#x66F8;&#x3067;&#x3082;&#x5E38;&#x306B;&#x5927;&#x4E8B;&#x3060;&#x3002;</p><ul><li>&#x4E00;&#x6587;&#x4E00;&#x6587;&#x304C;&#x66D6;&#x6627;&#x3067;&#x306A;&#x304F;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x3002;
</li>
<li>&#x6587;&#x3068;&#x6587;&#x306E;&#x3064;&#x306A;&#x304C;&#x308A;&#x304C;&#x660E;&#x78BA;&#x3067;&#xFF0C;&#x8457;&#x8005;&#x304C;&#x4F55;&#x3092;&#x4F1D;&#x3048;&#x3088;&#x3046;&#x3068;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#x8AAD;&#x8005;&#x306B;&#x5BB9;&#x6613;&#x306B;&#x4F1D;&#x308F;&#x308B;&#x3002;
</li>
<li>&#x8AAC;&#x660E;&#x306E;&#x9806;&#x5E8F;&#x304C;&#x5DE5;&#x592B;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#xFF0C;&#x8AAD;&#x8005;&#x304C;&#x300C;&#x306A;&#x308B;&#x307B;&#x3069;&#x306A;&#x308B;&#x307B;&#x3069;&#x300D;&#x3068;&#x30B9;&#x30E0;&#x30FC;&#x30BA;&#x306B;&#x8AAD;&#x307F;&#x9032;&#x3081;&#x3089;&#x308C;&#x308B;&#x3002;
</li>
<li>&#x56F3;&#x8868;&#xFF0C;&#x7B87;&#x6761;&#x66F8;&#x304D;&#xFF0C;&#x6570;&#x5F0F;&#x7B49;&#x304C;&#x9069;&#x5207;&#x306B;&#x4F7F;&#x308F;&#x308C;&#xFF0C;&#x76F4;&#x611F;&#x7684;&#x306A;&#x7406;&#x89E3;&#x3082;&#x53B3;&#x5BC6;&#x306A;&#x7406;&#x89E3;&#x3082;&#x3057;&#x3084;&#x3059;&#x3044;&#x3002;
</li></ul>
<p>&#x3053;&#x308C;&#x3089;&#x304C;&#xFF0C;&#x6587;&#x66F8;&#x306E;&#x826F;&#x3057;&#x60AA;&#x3057;&#x3092;&#x6C7A;&#x3081;&#x308B;&#x6700;&#x3082;&#x5927;&#x304D;&#x306A;&#x8981;&#x56E0;&#x3068;&#x8A00;&#x3063;&#x3066;&#x3088;&#x3044;&#x3060;&#x308D;&#x3046;&#x3002;
&#x540C;&#x6642;&#x306B;&#xFF0C;&#x4FEE;&#x5F97;&#x3059;&#x308B;&#x306E;&#x304C;&#x6700;&#x3082;&#x96E3;&#x3057;&#x3044;&#x4E8B;&#x67C4;&#x3068;&#x3082;&#x8A00;&#x3048;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002;
&#x3069;&#x3046;&#x3059;&#x308C;&#x3070;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x6587;&#x7AE0;&#xFF0C;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x8AAC;&#x660E;&#x306B;&#x306A;&#x308B;&#x304B;?&#x3000;
&#x77E5;&#x3063;&#x3066;&#x306E;&#x901A;&#x308A;&#xFF0C;&#x305D;&#x306E;&#x7B54;&#x306F;&#x5358;&#x7D14;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;
&#x4E0A;&#x8A18;&#x306E;&#x4E8B;&#x67C4;&#x306F;&#x975E;&#x5E38;&#x306B;&#x91CD;&#x8981;&#x3060;&#x304C;&#xFF0C;&#x3053;&#x3053;&#x3067;&#x306F;&#x305D;&#x306E;&#x89E3;&#x8AAC;&#x306F;&#x53C2;&#x8003;&#x66F8;&#x7C4D;&#x306B;&#x4EFB;&#x305B;&#x308B;&#x3053;&#x3068;&#x306B;&#x3057;&#x305F;&#x3044;&#x3002;
&#x4E0A;&#x8A18;&#x306E;&#x4E8B;&#x67C4;&#x3092;&#x5B66;&#x3076;&#x305F;&#x3081;&#x306E;&#x53C2;&#x8003;&#x66F8;&#x7C4D;&#x3068;&#x3057;&#x3066;&#x4F8B;&#x3048;&#x3070;&#x4EE5;&#x4E0B;&#x304C;&#x6319;&#x3052;&#x3089;&#x308C;&#x308B;&#xFF08;&#x307B;&#x304B;&#x306B;&#x3082;&#x305F;&#x304F;&#x3055;&#x3093;&#x3042;&#x308B;&#xFF09;&#x3002;
&#x5C11;&#x306A;&#x304F;&#x3068;&#x3082;&#x4E00;&#x518A;&#x306F;&#x8AAD;&#x3093;&#x3067;&#x307B;&#x3057;&#x3044;&#x3002;</p><ul><li>&#x5C0F;&#x5C71; &#x900F;&#x300E;&#x79D1;&#x5B66;&#x6280;&#x8853;&#x7CFB;&#x306E;&#x30E9;&#x30A4;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x6280;&#x6CD5;&#x300F;&#x6176;&#x61C9;&#x7FA9;&#x587E;&#x5927;&#x5B66;&#x51FA;&#x7248;&#x4F1A;, 2011.
 --- &#x96D1;&#x8A8C;&#x300E;bit&#x300F;&#x5143;&#x7DE8;&#x96C6;&#x9577;&#x306E;&#x8457;&#x66F8;
</li>
<li>&#x6728;&#x4E0B;&#x662F;&#x96C4;&#x300E;&#x7406;&#x79D1;&#x7CFB;&#x306E;&#x4F5C;&#x6587;&#x6280;&#x8853;&#x300F;&#x4E2D;&#x516C;&#x65B0;&#x66F8; 624, &#x4E2D;&#x592E;&#x516C;&#x8AD6;&#x65B0;&#x793E;, 1981.
 --- &#x53E4;&#x5178;&#x7684;&#x540D;&#x8457;
</li>
<li>&#x9152;&#x4E95;&#x8061;&#x6A39;&#x300E;100&#x30DA;&#x30FC;&#x30B8;&#x306E;&#x6587;&#x7AE0;&#x8853;&#x300F;&#x5171;&#x7ACB;&#x51FA;&#x7248;, 2011.
 --- 100&#x30DA;&#x30FC;&#x30B8;&#x3068;&#x77ED;&#x3044;
</li>
<li>&#x6CB3;&#x91CE;&#x54F2;&#x4E5F;&#x300E;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x30FB;&#x8AD6;&#x6587;&#x306E;&#x66F8;&#x304D;&#x65B9;&#x5165;&#x9580;&#x300F;&#x7B2C;3&#x7248;, &#x6176;&#x5FDC;&#x7FA9;&#x587E;&#x5927;&#x5B66;&#x51FA;&#x7248;&#x4F1A;, 2002.
 --- &#x3053;&#x3061;&#x3089;&#x306F;122&#x30DA;&#x30FC;&#x30B8;
</li></ul>
<p>&#x4F8B;&#x3048;&#x3070;&#x4E0B;&#x8A18;&#x306F;&#x300E;&#x7406;&#x79D1;&#x7CFB;&#x306E;&#x4F5C;&#x6587;&#x6280;&#x8853;&#x300F;&#x306E;&#x4E00;&#x7BC0;&#x3067;&#x3042;&#x308B;&#x3002;</p><blockquote><p><strong>&#x8A18;&#x8FF0;&#x306E;&#x9806;&#x5E8F;</strong></p><p>&#x8A18;&#x8FF0;&#x306E;&#x9806;&#x5E8F;&#x306B;&#x95A2;&#x3057;&#x3066;&#x306F;&#xFF0C;&#x4E8C;&#x3064;&#x306E;&#x9762;&#x304B;&#x3089;&#x306E;&#x8981;&#x6C42;&#x304C;&#x3042;&#x308B;&#x3002;</p><p>&#x4E00;&#x3064;&#x306F;&#xFF0C;&#x6587;&#x7AE0;&#x305C;&#x3093;&#x305F;&#x3044;&#x304C;&#x8AD6;&#x7406;&#x7684;&#x306A;&#x9806;&#x5E8F;&#x306B;&#x3057;&#x305F;&#x304C;&#x3063;&#x3066;&#x7D44;&#x307F;&#x7ACB;&#x3066;&#x3089;&#x308C;&#x3066;&#x3044;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3060;&#x3002;&#x4E00;&#x3064;&#x306E;&#x6587;&#x3068;&#x6B21;&#x306E;&#x6587;&#x3068;&#x304C;&#x304D;&#x3061;&#x3093;&#x3068;&#x9023;&#x7D50;&#x3055;&#x308C;&#x3066;&#x3044;&#x3066;&#xFF0C;&#x305D;&#x306E;&#x6D41;&#x308C;&#x3092;&#x305F;&#x3069;&#x3063;&#x3066;&#x3044;&#x304F;&#x3068;&#x81EA;&#x7136;&#x306B;&#x7D50;&#x8AD6;&#x306B;&#x5C0E;&#x304B;&#x308C;&#x308B;&#x3088;&#x3046;&#x306B;&#x66F8;&#x304F;&#x306E;&#x304C;&#x7406;&#x60F3;&#x3067;&#x3042;&#x308B;&#x3002;</p><p>&#x3082;&#x3046;&#x4E00;&#x3064;&#x306F;&#xFF0C;&#x76F8;&#x624B;&#xFF08;&#x8AAD;&#x8005;&#xFF09;&#x306F;&#x307E;&#x3063;&#x3055;&#x304D;&#x306B;&#x4F55;&#x3092;&#x77E5;&#x308A;&#x305F;&#x304C;&#x308B;&#x304B;&#xFF0C;&#x60C5;&#x5831;&#x3092;&#x3069;&#x3046;&#x3044;&#x3046;&#x9806;&#x5E8F;&#x306B;&#x306A;&#x3089;&#x3079;&#x308C;&#x3070;&#x8AAD;&#x8005;&#x306E;&#x671F;&#x5F85;&#x306B;&#x305D;&#x3048;&#x308B;&#x304B;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x914D;&#x616E;&#x3060;&#x3002;&#x6C17;&#x77ED;&#x304B;&#x306A;&#x4E0A;&#x53F8;&#x306F;&#x307E;&#x3063;&#x3055;&#x304D;&#x306B;&#x7D50;&#x8AD6;&#x3092;&#x77E5;&#x308A;&#x305F;&#x304C;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002;&#x30AB;&#x30E1;&#x30E9;&#x306E;&#x4F7F;&#x7528;&#x8AAC;&#x660E;&#x66F8;&#x306F;&#xFF0C;&#x65B0;&#x3057;&#x3044;&#x30AB;&#x30E1;&#x30E9;&#x3092;&#x624B;&#x306B;&#x3057;&#x305F;&#x4EBA;&#x306F;&#x6700;&#x521D;&#x306B;&#x3069;&#x3093;&#x306A;&#x3053;&#x3068;&#x3092;&#x3057;&#x3066;&#x307F;&#x308B;&#x304B;&#x3092;&#x8ABF;&#x3079;&#x305F;&#x4E0A;&#x3067;&#x66F8;&#x304B;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;</p><p><strong>&#x660E;&#x5FEB;&#x30FB;&#x7C21;&#x6F54;&#x306A;&#x6587;&#x7AE0;</strong></p><p>(&#x4E2D;&#x7565;)<br>
&#x7C21;&#x6F54;&#x306A;&#x8868;&#x73FE;&#x306F;&#xFF0C;&#x5FD9;&#x3057;&#x3044;&#x73FE;&#x4EE3;&#x751F;&#x6D3B;&#x306E;&#x8981;&#x6C42;&#x306B;&#x3053;&#x305F;&#x3048;&#x308B;&#x305F;&#x3081;&#x3060;&#x3051;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x306E;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;&#x30C1;&#x30E3;&#x30FC;&#x30C1;&#x30EB;&#x3082;&#x8A00;&#x3063;&#x3066;&#x3044;&#x308B;&#x304C;&#xFF0C;&#x4E0D;&#x8981;&#x306A;&#x3053;&#x3068;&#x3070;&#x306F;&#x4E00;&#x8A9E;&#x3067;&#x3082;&#x524A;&#x308D;&#x3046;&#x3068;&#x52AA;&#x529B;&#x3059;&#x308B;&#x3046;&#x3061;&#x306B;&#xFF0C;&#x8A00;&#x3044;&#x305F;&#x3044;&#x3053;&#x3068;&#x304C;&#x660E;&#x78BA;&#x306B;&#x6D6E;&#x304D;&#x5F6B;&#x308A;&#x306B;&#x306A;&#x3063;&#x3066;&#x304F;&#x308B;&#x306E;&#x3067;&#x3042;&#x308B;&#x3002;</p><p>--- &#x6728;&#x4E0B;&#x662F;&#x96C4;&#x300E;&#x7406;&#x79D1;&#x7CFB;&#x306E;&#x4F5C;&#x6587;&#x6280;&#x8853;&#x300F;1.2&#x7BC0;&#x300C;&#x3053;&#x306E;&#x66F8;&#x7269;&#x306E;&#x76EE;&#x6A19;&#x300D;pp.8--9.</p></blockquote><p>&#x86C7;&#x8DB3;&#x306A;&#x304C;&#x3089;&#x4ED8;&#x3051;&#x52A0;&#x3048;&#x308B;&#x3068;&#xFF0C;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x6587;&#x7AE0;&#x3092;&#x66F8;&#x304F;&#x305F;&#x3081;&#x306B;&#x5BB9;&#x6613;&#x306B;&#x5B9F;&#x8DF5;&#x3067;&#x304D;&#x308B;&#x65B9;&#x6CD5;&#x306F;&#xFF0C;
&#x300C;&#x66F8;&#x3044;&#x305F;&#x539F;&#x7A3F;&#x3092;&#x4F55;&#x5EA6;&#x3082;&#x8AAD;&#x307F;&#x8FD4;&#x3059;&#x3002;&#x7279;&#x306B;&#xFF0C;&#x4E00;&#x6669;&#x304B;&#x4E8C;&#x6669;&#xFF0C;&#x6642;&#x9593;&#x3092;&#x3042;&#x3051;&#x3066;&#x8AAD;&#x307F;&#x8FD4;&#x3059;&#x300D;&#x3053;&#x3068;&#x3060;&#x3002;
&#x305C;&#x3072;&#x5B9F;&#x8DF5;&#x3057;&#x3066;&#xFF0C;&#x3088;&#x3044;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x4ED5;&#x4E0A;&#x3052;&#x3066;&#x6B32;&#x3057;&#x3044;&#xFF08;&#x8AAD;&#x307E;&#x3055;&#x308C;&#x308B;&#x5074;&#x306E;&#x5207;&#x306A;&#x308B;&#x304A;&#x9858;&#x3044;&#xFF09;&#x3002;</p>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="write.html" class="navigation navigation-prev " aria-label="Previous page: 4-a. writeシステムコールによる文字列の出力">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="report-work.html" class="navigation navigation-next " aria-label="Next page: 5-a. 実験レポート練習問題">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"5. 実験レポートの書き方","level":"2.5","depth":1,"next":{"title":"5-a. 実験レポート練習問題","level":"2.5.1","depth":2,"path":"part1/report-work.md","ref":"part1/report-work.md","articles":[]},"previous":{"title":"4-a. writeシステムコールによる文字列の出力","level":"2.4.1","depth":2,"path":"part1/write.md","ref":"part1/write.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"情報学群実験第2","gitbook":"*"},"file":{"path":"part1/report.md","mtime":"2016-09-28T10:08:29.000Z","type":"markdown"},"gitbook":{"version":"3.2.0","time":"2016-10-28T08:16:58.511Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

