
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <title>5-a. 実験レポート練習問題 · 情報学群実験第2</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.0">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="stack.html" />
    
    
    <link rel="prev" href="report.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../preface/">
            
                <a href="../preface/">
            
                    
                    はじめに
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../preface/goal.html">
            
                <a href="../preface/goal.html">
            
                    
                    達成目標
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../preface/bookmark.html">
            
                <a href="../preface/bookmark.html">
            
                    
                    情報のありか
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="header">Part I: i386アセンブリプログラミング</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="hellohex.html">
            
                <a href="hellohex.html">
            
                    
                    1. 機械語とアセンブリ言語
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="binaryfiles.html">
            
                <a href="binaryfiles.html">
            
                    
                    1-a. 補足：ファイル間の関係
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="github.html">
            
                <a href="github.html">
            
                    
                    1-b. GitHubアカウントの取得
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="i386.html">
            
                <a href="i386.html">
            
                    
                    1-c. i386アーキテクチャの基礎知識
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="arith.html">
            
                <a href="arith.html">
            
                    
                    2. さまざまな演算命令
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.2.1" data-path="github-team.html">
            
                <a href="github-team.html">
            
                    
                    2-a. グループ用GitHubリポジトリの作成
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.2" data-path="github-dev.html">
            
                <a href="github-dev.html">
            
                    
                    2-b. Gitを使った開発作業
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="jump.html">
            
                <a href="jump.html">
            
                    
                    3. 条件分岐と繰り返し
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="memory.html">
            
                <a href="memory.html">
            
                    
                    4. 主記憶領域
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.4.1" data-path="write.html">
            
                <a href="write.html">
            
                    
                    4-a. writeシステムコールによる文字列の出力
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="report.html">
            
                <a href="report.html">
            
                    
                    5. 実験レポートの書き方
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="2.5.1" data-path="report-work.html">
            
                <a href="report-work.html">
            
                    
                    5-a. 実験レポート練習問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="stack.html">
            
                <a href="stack.html">
            
                    
                    6. スタックとサブルーチン呼び出し
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.6.1" data-path="separate-asm.html">
            
                <a href="separate-asm.html">
            
                    
                    6-a. ソースファイルの分割
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="make.html">
            
                <a href="make.html">
            
                    
                    7. makeコマンドによる省力化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="logical-op.html">
            
                <a href="logical-op.html">
            
                    
                    8. 論理演算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.9" data-path="vram.html">
            
                <a href="vram.html">
            
                    
                    9. VRAM直接書き込み
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >5-a. 実験レポート練習問題</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x7DF4;&#x7FD2;&#x554F;&#x984C;">&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x7DF4;&#x7FD2;&#x554F;&#x984C;</h1><p>&#x300C;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x69CB;&#x6210;&#x6848;&#x300D;&#x3092;&#x8A18;&#x8FF0;&#x3059;&#x308B;&#x7DF4;&#x7FD2;&#x3092;&#x3057;&#x3088;&#x3046;&#x3002;
&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x69CB;&#x6210;&#x6848;&#x3068;&#x306F;&#xFF0C;&#x300C;&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#xFF08;&#x4F55;&#x306E;&#x305F;&#x3081;&#x306B;&#xFF09;&#x300D;&#x300C;&#x5B9F;&#x9A13;&#x65B9;&#x6CD5;&#xFF08;&#x4F55;&#x3092;&#x884C;&#x3044;&#xFF09;&#x300D;&#x300C;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#xFF08;&#x3069;&#x3046;&#x306A;&#x3063;&#x305F;&#x304B;&#xFF09;&#x300D;&#x300C;&#x8003;&#x5BDF;&#xFF08;&#x4F55;&#x304C;&#x4E3B;&#x5F35;&#x3067;&#x304D;&#x308B;&#x304B;&#xFF09;&#x300D;&#x306E;&#x5404;&#x9805;&#x306B;&#x305D;&#x308C;&#x305E;&#x308C;&#x4F55;&#x3092;&#x66F8;&#x304F;&#x304B;&#x3092;&#x8FF0;&#x3079;&#x305F;&#x3082;&#x306E;&#xFF0C;&#x3068;&#x3053;&#x3053;&#x3067;&#x306F;&#x5B9A;&#x7FA9;&#x3059;&#x308B;&#x3002;
&#x672C;&#x756A;&#x306E;&#x6587;&#x66F8;&#x3067;&#x306F;&#x306A;&#x3044;&#x306E;&#x3067;&#xFF0C;&#x7B87;&#x6761;&#x66F8;&#x304D;&#x306E;&#x307F;&#x3060;&#x3063;&#x305F;&#x308A;&#x4F53;&#x8A00;&#x6B62;&#x3081;&#x306E;&#x6587;&#x304C;&#x591A;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;&#x308A;&#x3057;&#x3066;&#x3082;&#x69CB;&#x308F;&#x306A;&#x3044;&#x3057;&#xFF0C;&#x8A73;&#x7D30;&#x306F;&#x7701;&#x3044;&#x3066;&#x3044;&#x3066;&#x3082;&#x69CB;&#x308F;&#x306A;&#x3044;&#x3002;
&#x3080;&#x3057;&#x308D;&#x300C;&#x4F55;&#x3068;&#x4F55;&#x3068;&#x4F55;&#x3092;&#x66F8;&#x304F;&#x304B;&#x300D;&#x3092;&#xFF08;&#x81EA;&#x5206;&#x306B;&#x5BFE;&#x3057;&#x3066; &amp; &#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x306B;&#x5BFE;&#x3057;&#x3066;&#xFF09;&#x660E;&#x3089;&#x304B;&#x306B;&#x3057;&#xFF0C;&#x8A71;&#x304C;&#x4E00;&#x8CAB;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x76EE;&#x7684;&#x306A;&#x306E;&#x3067;&#xFF0C;&#x305D;&#x3053;&#x306B;&#x6CE8;&#x529B;&#x3059;&#x308B;&#x65B9;&#x304C;&#x3088;&#x3044;&#x3002;</p><p><strong>&#x6F14;&#x7FD2;1.5-1</strong>&#x3000;
&#x6F14;&#x7FD2;1.3-1&#x301C;1.3-4&#x306E;&#x4E2D;&#x304B;&#x3089;&#x5404;&#x81EA;1&#x554F;&#x305A;&#x3064;&#x9078;&#x3073;&#xFF0C;&#x305D;&#x306E;&#x6F14;&#x7FD2;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x300C;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x69CB;&#x6210;&#x6848;&#x300D;&#x3092;&#x8A18;&#x8FF0;&#x3057;&#x306A;&#x3055;&#x3044;&#x3002;&#x4ED6;&#x306E;&#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x3068;&#x306F;&#x7570;&#x306A;&#x308B;&#x6F14;&#x7FD2;&#x554F;&#x984C;&#x3092;&#x9078;&#x3076;&#x3053;&#x3068;&#x3002;
&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x4E2D;&#x306E;&#x30B5;&#x30D6;&#x30C7;&#x30A3;&#x30EC;&#x30AF;&#x30C8;&#x30EA; chap3 &#x306E;&#x4E2D;&#x306E; report-XXX.md &#x3068;&#x3044;&#x3046;&#x540D;&#x524D;&#x306E;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x8A18;&#x8FF0;&#x3057;&#x306A;&#x3055;&#x3044;&#xFF08;Markdown&#x5F62;&#x5F0F;&#x3067;&#x8A18;&#x8FF0;&#x3057;&#x3066;&#x3082;&#x3088;&#x3044;&#xFF09;&#x3002;&#x305F;&#x3060;&#x3057;&#xFF0C;XXX &#x306E;&#x90E8;&#x5206;&#x306B;&#x306F;&#xFF0C;&#x305D;&#x306E;&#x6F14;&#x7FD2;&#x3067;&#x4F5C;&#x6210;&#x3057;&#x305F;&#x30A2;&#x30BB;&#x30F3;&#x30D6;&#x30EA;&#x8A00;&#x8A9E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#xFF08;&#x304B;&#x3089; .s &#x3092;&#x9664;&#x3044;&#x305F;&#x3082;&#x306E;&#xFF09;&#x304C;&#x5165;&#x308B;&#xFF08;&#x4E0B;&#x8A18;&#xFF09;&#x3002;
&#x4F5C;&#x6210;&#x3057;&#x305F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x5171;&#x6709;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306B;push&#x3057;&#x306A;&#x3055;&#x3044;&#x3002;</p><ul><li>&#x6F14;&#x7FD2;1.3-1 &#x2026; report-fib13.md
</li>
<li>&#x6F14;&#x7FD2;1.3-2 &#x2026; report-isprime.md
</li>
<li>&#x6F14;&#x7FD2;1.3-3 &#x2026; report-nprime255.md
</li>
<li>&#x6F14;&#x7FD2;1.3-4 &#x2026; report-10thprime.md
</li></ul>
<p><strong>&#x6F14;&#x7FD2;1.5-2</strong>&#x3000;
&#x81EA;&#x5206;&#x4EE5;&#x5916;&#x306E;&#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x306E;&#x300C;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x69CB;&#x6210;&#x6848;&#x300D;&#x3092;&#x8AAD;&#x307F;&#xFF0C;&#x4E0B;&#x8A18;&#x306E;&#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x9805;&#x76EE;&#x305D;&#x308C;&#x305E;&#x308C;&#x306B;&#x3064;&#x3044;&#x3066;&#xFF0C;&#x4FEE;&#x6B63;&#x3059;&#x3079;&#x304D;&#x70B9;&#x3084;&#x6539;&#x5584;&#x6848;&#x3092;&#x8A18;&#x8FF0;&#x3057;&#x306A;&#x3055;&#x3044;&#xFF08;&#x3053;&#x306E;&#x3088;&#x3046;&#x306A;&#x4F5C;&#x696D;&#x3092;<strong>&#x30EC;&#x30D3;&#x30E5;&#x30FC;</strong>&#x3068;&#x8A00;&#x3046;&#xFF09;&#x3002;
3&#x4EBA;&#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x306E;&#x5834;&#x5408;&#xFF0C;&#x81EA;&#x5206;&#x4EE5;&#x5916;&#x306E;2&#x540D;&#x306E;&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x306E;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x69CB;&#x6210;&#x6848;&#x306E;<strong>&#x4E21;&#x65B9;</strong>&#x3092;&#x30EC;&#x30D3;&#x30E5;&#x30FC;&#x3057;&#x306A;&#x3055;&#x3044;&#x3002;</p><ol><li>&#x300C;&#x25CB;&#x25CB;&#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x3092;&#x660E;&#x3089;&#x304B;&#x306B;&#x3059;&#x308B;&#xFF08;&#x4EEE;&#x8AAC;&#x3092;&#x691C;&#x8A3C;&#x3059;&#x308B;&#xFF09;&#x300D;&#x3068;&#x3044;&#x3046;&#x5F62;&#x5F0F;&#x3067;&#x300C;&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#x300D;&#x304C;&#x66F8;&#x304B;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;
</li>
<li>&#x300C;&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#x300D;&#x306F;&#x6F14;&#x7FD2;&#x306E;&#x5185;&#x5BB9;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x59A5;&#x5F53;&#x3067;&#x3042;&#x308B;&#xFF08;&#x6F14;&#x7FD2;&#x5185;&#x5BB9;&#x306B;&#x305D;&#x3050;&#x308F;&#x306A;&#x3044;&#x3082;&#x306E;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x306A;&#x3044;&#xFF09;&#x3002;
</li>
<li>&#x300C;&#x5B9F;&#x9A13;&#x65B9;&#x6CD5;&#x300D;&#x3067;&#x8FF0;&#x3079;&#x305F;&#x65B9;&#x6CD5;&#x306B;&#x3088;&#x3063;&#x3066;&#x300C;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x300D;&#x306E;&#x5185;&#x5BB9;&#x304C;&#x5F97;&#x3089;&#x308C;&#xFF0C;&#x300C;&#x5B9F;&#x9A13;&#x7D50;&#x679C;&#x300D;&#x306E;&#x5185;&#x5BB9;&#x304B;&#x3089;&#x300C;&#x8003;&#x5BDF;&#x300D;&#x306E;&#x5185;&#x5BB9;&#x304C;&#x5F97;&#x3089;&#x308C;&#x308B;&#xFF08;&#x98DB;&#x8E8D;&#x3084;&#x77DB;&#x76FE;&#x304C;&#x306A;&#x3044;&#xFF09;&#x3002;
</li>
<li>&#x300C;&#x8003;&#x5BDF;&#x300D;&#x304C;&#x300C;&#x5B9F;&#x9A13;&#x306E;&#x76EE;&#x7684;&#x300D;&#x306B;&#x5408;&#x81F4;&#x3057;&#x3066;&#x3044;&#x308B;&#xFF08;&#x4EEE;&#x8AAC;&#x306E;&#x6210;&#x5426;&#x3092;&#x8FF0;&#x3079;&#x3066;&#x3044;&#x308B;&#xFF09;&#x3002;
</li>
<li>&#x3069;&#x306E;&#x3088;&#x3046;&#x306A;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x4F5C;&#x3063;&#x305F;&#x304B;&#xFF0C;&#x3069;&#x306E;&#x3088;&#x3046;&#x306A;&#x5B9F;&#x9A13;&#x3084;&#x52D5;&#x4F5C;&#x30C6;&#x30B9;&#x30C8;&#x3092;&#x884C;&#x3063;&#x305F;&#x304B;&#xFF0C;&#x8AAD;&#x8005;&#x304C;&#x7406;&#x89E3;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x4E8B;&#x67C4;&#x304C;&#x3059;&#x3079;&#x3066;&#x6319;&#x3052;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;
</li>
<li>&#x5DE5;&#x592B;&#x70B9;&#x306A;&#x3069;&#xFF0C;&#x30A2;&#x30D4;&#x30FC;&#x30EB;&#x3067;&#x304D;&#x308B;&#x4E8B;&#x67C4;&#x3092;&#x3082;&#x308C;&#x306A;&#x304F;&#x76DB;&#x308A;&#x8FBC;&#x3093;&#x3067;&#x3044;&#x308B;&#x3002;
</li></ol>
<p>GitHub&#x4E0A;&#x3067;&#xFF0C;&#x30EC;&#x30D3;&#x30E5;&#x30FC;&#x5BFE;&#x8C61;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x69CB;&#x6210;&#x6848;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x6700;&#x7D42;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x3068;&#x3057;&#x3066;&#x8A18;&#x8FF0;&#x3057;&#x306A;&#x3055;&#x3044;&#x3002;&#x5F53;&#x8A72;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x306E;&#x8A73;&#x7D30;&#x30DA;&#x30FC;&#x30B8;&#x3092;&#x958B;&#x304D;&#xFF0C;&#x30DA;&#x30FC;&#x30B8;&#x4E0B;&#x90E8;&#x306E;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x6B04;&#xFF08;&#x4E0B;&#x56F3;&#x306E;&#x8D64;&#x67A0;&#xFF09;&#x306B;&#x8A18;&#x8FF0;&#x3059;&#x308C;&#x3070;&#x3088;&#x3044;&#x3002;</p><p><img alt="Commit comment" src="images/github-commit-comment.png" width="600"></p><p><strong>&#x6F14;&#x7FD2;1.5-3</strong>&#x3000;
&#x30EC;&#x30D3;&#x30E5;&#x30FC;&#x7D50;&#x679C;&#x306B;&#x57FA;&#x3065;&#x3044;&#x3066;&#xFF0C;&#x6F14;&#x7FD2;1.5-1&#x3067;&#x8A18;&#x8FF0;&#x3057;&#x305F;&#x5B9F;&#x9A13;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x69CB;&#x6210;&#x6848;&#x3092;&#x6539;&#x8A02;&#x3057;&#x306A;&#x3055;&#x3044;&#x3002;
&#x6539;&#x8A02;&#x7D50;&#x679C;&#x3092;&#x5171;&#x6709;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306B;push&#x3059;&#x308B;&#x3053;&#x3068;&#x3002;</p>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="report.html" class="navigation navigation-prev " aria-label="Previous page: 5. 実験レポートの書き方">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="stack.html" class="navigation navigation-next " aria-label="Next page: 6. スタックとサブルーチン呼び出し">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"5-a. 実験レポート練習問題","level":"2.5.1","depth":2,"next":{"title":"6. スタックとサブルーチン呼び出し","level":"2.6","depth":1,"path":"part1/stack.md","ref":"part1/stack.md","articles":[{"title":"6-a. ソースファイルの分割","level":"2.6.1","depth":2,"path":"part1/separate-asm.md","ref":"part1/separate-asm.md","articles":[]}]},"previous":{"title":"5. 実験レポートの書き方","level":"2.5","depth":1,"path":"part1/report.md","ref":"part1/report.md","articles":[{"title":"5-a. 実験レポート練習問題","level":"2.5.1","depth":2,"path":"part1/report-work.md","ref":"part1/report-work.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"情報学群実験第2","gitbook":"*"},"file":{"path":"part1/report-work.md","mtime":"2016-10-25T12:37:52.000Z","type":"markdown"},"gitbook":{"version":"3.2.0","time":"2016-10-28T08:16:58.511Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

