
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <title>はじめに · 情報学群実験第2</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.0">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="goal.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    はじめに
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="goal.html">
            
                <a href="goal.html">
            
                    
                    達成目標
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="bookmark.html">
            
                <a href="bookmark.html">
            
                    
                    情報のありか
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="header">Part I: i386アセンブリプログラミング</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../part1/hellohex.html">
            
                <a href="../part1/hellohex.html">
            
                    
                    1. 機械語とアセンブリ言語
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="../part1/binaryfiles.html">
            
                <a href="../part1/binaryfiles.html">
            
                    
                    1-a. 補足：ファイル間の関係
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="../part1/github.html">
            
                <a href="../part1/github.html">
            
                    
                    1-b. GitHubアカウントの取得
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="../part1/i386.html">
            
                <a href="../part1/i386.html">
            
                    
                    1-c. i386アーキテクチャの基礎知識
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../part1/arith.html">
            
                <a href="../part1/arith.html">
            
                    
                    2. さまざまな演算命令
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.2.1" data-path="../part1/github-team.html">
            
                <a href="../part1/github-team.html">
            
                    
                    2-a. グループ用GitHubリポジトリの作成
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.2" data-path="../part1/github-dev.html">
            
                <a href="../part1/github-dev.html">
            
                    
                    2-b. Gitを使った開発作業
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../part1/jump.html">
            
                <a href="../part1/jump.html">
            
                    
                    3. 条件分岐と繰り返し
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../part1/memory.html">
            
                <a href="../part1/memory.html">
            
                    
                    4. 主記憶領域
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.4.1" data-path="../part1/write.html">
            
                <a href="../part1/write.html">
            
                    
                    4-a. writeシステムコールによる文字列の出力
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="../part1/report.html">
            
                <a href="../part1/report.html">
            
                    
                    5. 実験レポートの書き方
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.5.1" data-path="../part1/report-work.html">
            
                <a href="../part1/report-work.html">
            
                    
                    5-a. 実験レポート練習問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="../part1/stack.html">
            
                <a href="../part1/stack.html">
            
                    
                    6. スタックとサブルーチン呼び出し
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.6.1" data-path="../part1/separate-asm.html">
            
                <a href="../part1/separate-asm.html">
            
                    
                    6-a. ソースファイルの分割
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="../part1/make.html">
            
                <a href="../part1/make.html">
            
                    
                    7. makeコマンドによる省力化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="../part1/logical-op.html">
            
                <a href="../part1/logical-op.html">
            
                    
                    8. 論理演算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.9" data-path="../part1/vram.html">
            
                <a href="../part1/vram.html">
            
                    
                    9. VRAM直接書き込み
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >はじめに</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x306F;&#x3058;&#x3081;&#x306B;">&#x306F;&#x3058;&#x3081;&#x306B;</h1><p>&#x4E16;&#x754C;&#x6700;&#x521D;&#x671F;&#x306E;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;
<span style="letter-spacing:-2px">---------</span>
&#x4F8B;&#x3048;&#x3070;ENIAC
<span style="letter-spacing:-2px">---------</span>
&#x306F;&#xFF0C;&#x305D;&#x308C;&#x3092;&#x4F7F;&#x3044;&#x305F;&#x3044;&#x7814;&#x7A76;&#x8005;&#x304C;&#x81EA;&#x5206;&#x3067;&#x4F5C;&#x3063;&#x305F;&#x300C;&#x624B;&#x4F5C;&#x308A;&#x306E;&#x5B9F;&#x9A13;&#x88C5;&#x7F6E;&#x300D;&#x3060;&#x3063;&#x305F;&#x3002;
&#x4F7F;&#x3046;&#x4EBA;&#x306F;&#x305D;&#x306E;&#x5185;&#x90E8;&#x3092;&#x8A73;&#x7D30;&#x306B;&#x77E5;&#x3063;&#x3066;&#x3044;&#x305F;&#x3057;&#xFF0C;&#x77E5;&#x3089;&#x306A;&#x3051;&#x308C;&#x3070;&#x4F7F;&#x3048;&#x306A;&#x304B;&#x3063;&#x305F;&#x3002;
&#x73FE;&#x4EE3;&#x306E;&#x50D5;&#x3089;&#x306E;&#x5468;&#x308A;&#x306E;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;
<span style="letter-spacing:-2px">---------</span>
&#x30D1;&#x30BD;&#x30B3;&#x30F3;&#x3084;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30D5;&#x30A9;&#x30F3;&#x306A;&#x3069;
<span style="letter-spacing:-2px">---------</span>
&#x306F;&#x5F53;&#x6642;&#x306E;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3088;&#x308A;&#x306F;&#x308B;&#x304B;&#x306B;&#x4F7F;&#x3044;&#x3084;&#x3059;&#x304F;&#x4F5C;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;
&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306F;&#xFF0C;&#x5185;&#x90E8;&#x306E;&#x8A73;&#x7D30;&#x3092;&#x77E5;&#x3089;&#x306A;&#x304F;&#x3066;&#x3082;&#xFF0C;&#x79D1;&#x5B66;&#x8005;&#x3058;&#x3083;&#x306A;&#x304F;&#x3066;&#x3082;&#xFF0C;&#x8AB0;&#x3067;&#x3082;&#x4F7F;&#x3048;&#x308B;&#x6A5F;&#x68B0;&#x306B;&#x306A;&#x3063;&#x305F;&#x3002;
&#x5185;&#x90E8;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x3092;&#x77E5;&#x3089;&#x306A;&#x304F;&#x3066;&#x3082;&#x51B7;&#x8535;&#x5EAB;&#x304C;&#x4F7F;&#x3048;&#x308B;&#x3088;&#x3046;&#x306B;&#x3002;&#x5185;&#x90E8;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x3092;&#x77E5;&#x3089;&#x306A;&#x304F;&#x3066;&#x3082;TV&#x3092;&#x89B3;&#x3089;&#x308C;&#x308B;&#x3088;&#x3046;&#x306B;&#x3002;
&#x5185;&#x90E8;&#x306E;&#x8A73;&#x7D30;&#x3092;&#x5229;&#x7528;&#x8005;&#x306B;&#x96A0;&#x3057;&#x3066;&#xFF0C;&#x5229;&#x7528;&#x3059;&#x308B;&#x306E;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x90E8;&#x5206;&#x3060;&#x3051;&#x3092;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x5F62;&#x306B;&#x3057;&#x3066;&#x63D0;&#x4F9B;&#x3057;&#x3066;&#x3044;&#x308B;&#x308F;&#x3051;&#x3060;&#x3002;
&#x305D;&#x308C;&#x306F;&#x3082;&#x3061;&#x308D;&#x3093;&#x9032;&#x6B69;&#x3067;&#x3042;&#x308B;&#x3057;&#x826F;&#x3044;&#x3053;&#x3068;&#x306A;&#x306E;&#x3060;&#x3051;&#x308C;&#x3069;&#xFF0C;&#x53CD;&#x9762;&#xFF0C;&#x300C;&#x666E;&#x901A;&#x306B;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x9593;&#x306F;&#x300E;&#x5185;&#x90E8;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x300F;&#x306B;&#x89E6;&#x308C;&#x308B;&#x6A5F;&#x4F1A;&#x304C;&#x307B;&#x3068;&#x3093;&#x3069;&#x306A;&#x3044;&#x300D;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3082;&#x3042;&#x308B;&#x3002;</p><p>&#x3053;&#x306E;&#x6388;&#x696D;&#x300C;&#x60C5;&#x5831;&#x5B66;&#x7FA4;&#x5B9F;&#x9A13;&#x7B2C;2&#x300D;&#x306F;&#xFF0C;&#x300C;<b>&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306E;&#x5185;&#x90E8;&#x306E;&#x4ED5;&#x7D44;&#x307F;</b>&#x300D;&#x3092;&#x5B66;&#x3076;&#x305F;&#x3081;&#x306E;&#x6388;&#x696D;&#x3060;&#x3002;
1&#x5B66;&#x671F;&#x306E;&#x300C;&#x60C5;&#x5831;&#x5B66;&#x7FA4;&#x5B9F;&#x9A13;&#x7B2C;1&#x300D;&#x300C;&#x30A2;&#x30EB;&#x30B4;&#x30EA;&#x30BA;&#x30E0;&#x3068;&#x30C7;&#x30FC;&#x30BF;&#x69CB;&#x9020;&#x300D;&#x300C;&#x8A08;&#x7B97;&#x6A5F;&#x8A00;&#x8A9E;&#x300D;&#x3067;&#x306F;&#xFF0C;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x57FA;&#x672C;&#x8981;&#x7D20;
<span style="letter-spacing:-2px">---------</span>
if, for, while&#x3068;&#x5909;&#x6570;&#x3068;&#x914D;&#x5217;&#x3068;&#x56DB;&#x5247;&#x6F14;&#x7B97;
<span style="letter-spacing:-2px">---------</span>
&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x3066;&#xFF0C;&#x6574;&#x5217;&#x3084;&#x63A2;&#x7D22;&#x3084;&#x6587;&#x5B57;&#x5217;&#x7167;&#x5408;&#x306A;&#x3069;&#x306E;<b>&#x30A2;&#x30EB;&#x30B4;&#x30EA;&#x30BA;&#x30E0;</b>&#x3092;&#x69CB;&#x7BC9;&#x3057;&#x305F;&#x308A;&#xFF0C;<b>&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x6307;&#x5411;</b>&#x306E;&#x8003;&#x3048;&#x65B9;&#x306B;&#x6CBF;&#x3063;&#x3066;&#x554F;&#x984C;&#x3092;&#x5206;&#x6790;&#x3057;&#x3066;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x5316;&#x3057;&#x305F;&#x308A;&#x3059;&#x308B;&#x65B9;&#x6CD5;&#x3092;&#x5B66;&#x3093;&#x3060;&#x3068;&#x601D;&#x3046;&#x3051;&#x3069;&#xFF0C;&#x3053;&#x308C;&#x306F;&#x3064;&#x307E;&#x308A;&#xFF0C;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x57FA;&#x672C;&#x8981;&#x7D20;&#x3092;&#x571F;&#x53F0;&#x3068;&#x3057;&#x3066;&#xFF0C;&#x305D;&#x306E;&#x4E0A;&#x306B;&#x7269;&#x4E8B;&#x3092;&#x69CB;&#x7BC9;&#x3057;&#x3066;&#x3044;&#x304F;&#x65B9;&#x6CD5;&#x3092;&#x5B66;&#x3093;&#x3060;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3060;&#x3002;
&#x305D;&#x308C;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x3053;&#x306E;&#x6388;&#x696D;&#x306F;&#xFF0C;&#x3080;&#x3057;&#x308D;&#x9006;&#x65B9;&#x5411;&#x3067;&#xFF0C;<b>&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x57FA;&#x672C;&#x8981;&#x7D20;&#x304C;&#x3069;&#x3046;&#x3044;&#x3046;&#x4ED5;&#x7D44;&#x307F;&#x306B;&#x3088;&#x3063;&#x3066;&#x5B9F;&#x73FE;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x304B;</b>
<span style="letter-spacing:-2px">---------</span>
&#x4F8B;&#x3048;&#x3070;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30E9;&#x306F;&#x4F55;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#xFF0C;&#x30AA;&#x30DA;&#x30EC;&#x30FC;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x30B7;&#x30B9;&#x30C6;&#x30E0; (OS) &#x306F;&#x4F55;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#xFF0C;
&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x30CF;&#x30FC;&#x30C9;&#x30A6;&#x30A7;&#x30A2;&#x306F;&#x3069;&#x3046;&#x3044;&#x3046;&#x4ED5;&#x7D44;&#x307F;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x304B;
<span style="letter-spacing:-2px">---------</span>
&#x3068;&#x3044;&#x3063;&#x305F;&#x3053;&#x3068;&#xFF08;&#x306E;&#x521D;&#x6B69;&#x306E;&#x90E8;&#x5206;&#xFF09;&#x3092;&#x5B66;&#x3076;&#x3002;
&#x3064;&#x307E;&#x308A;&#xFF0C;&#x3053;&#x308C;&#x307E;&#x3067;&#x300C;&#x571F;&#x53F0;&#x300D;&#x3068;&#x8003;&#x3048;&#x3066;&#x304D;&#x305F;&#x90E8;&#x5206;&#x306E;&#x305D;&#x306E;&#x4E2D;&#x8EAB;&#x3092;&#x898B;&#x3066;&#x3044;&#x3053;&#x3046;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x308F;&#x3051;&#x3060;&#x3002;</p><p>&#x300C;&#x300E;&#x5185;&#x90E8;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x300F;&#x306A;&#x3093;&#x3066;&#x5B66;&#x3076;&#x5FC5;&#x8981;&#x3042;&#x308B;&#x306E;?&#x300D;</p><p><span style="letter-spacing:-2px">---------</span>
&#x3042;&#x308B;!&#x3000;
&#x3060;&#x3063;&#x3066;&#x60C5;&#x5831;&#x5B66;&#x7FA4;&#x306F;&#x300C;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#xFF08;&#x306B;&#x95A2;&#x308F;&#x308B;&#x4F55;&#x304B;&#xFF09;&#x306E;&#x5C02;&#x9580;&#x5BB6;&#x300D;&#x306B;&#x306A;&#x308B;&#x305F;&#x3081;&#x306E;&#x5834;&#x6240;&#x306A;&#x306E;&#x3060;&#x304B;&#x3089;&#x3002;</p><p>&#x3053;&#x308C;&#x306F;&#xFF0C;&#x300C;&#x5C06;&#x6765;&#x541B;&#x305F;&#x3061;&#x304C;&#x300E;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30E9;&#x3092;&#x81EA;&#x5206;&#x3067;&#x4F5C;&#x308B;&#x300F;&#x3068;&#x304B;&#x300E;OS&#x3092;&#x6539;&#x9020;&#x3059;&#x308B;&#x300F;&#x3068;&#x304B;&#x300E;&#x30CF;&#x30FC;&#x30C9;&#x30A6;&#x30A7;&#x30A2;&#x3092;&#x8A2D;&#x8A08;&#x3059;&#x308B;&#x300F;&#x3088;&#x3046;&#x306A;&#x4ED5;&#x4E8B;&#x306B;&#x5C31;&#x304F;&#x300D;&#x3068;&#x3044;&#x3046;&#x610F;&#x5473;&#x3058;&#x3083;&#x306A;&#x3044;&#xFF08;&#x305D;&#x3046;&#x3044;&#x3046;&#x4EBA;&#x3082;&#x5C11;&#x3057;&#x306F;&#x5C45;&#x308B;&#x3068;&#x601D;&#x3046;&#x3051;&#x3069;&#xFF09;&#x3002;
&#x5B9F;&#x969B;&#x306B;&#x300C;&#x5185;&#x90E8;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x300D;&#x3092;&#x3044;&#x3058;&#x3089;&#x306A;&#x304F;&#x3066;&#x306F;&#x306A;&#x3089;&#x306A;&#x3044;&#x6A5F;&#x4F1A;&#x306F;&#x305F;&#x3076;&#x3093;&#x5C11;&#x306A;&#x3044;&#x3002;
&#x3057;&#x304B;&#x3057;&#xFF0C;&#x300C;&#x305D;&#x306E;&#x90E8;&#x5206;&#x306F;&#x77E5;&#x3089;&#x306A;&#x304F;&#x3066;&#x3044;&#x3044;&#x300D;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;
&#x4F55;&#x304B;&#x306E;&#x5F62;&#x3067;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306B;&#x643A;&#x308F;&#x308B;&#x4ED5;&#x4E8B;&#xFF0C;
&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x4F55;&#x304B;&#x3092;&#x4F5C;&#x308A;&#x51FA;&#x3059;&#x4ED5;&#x4E8B;&#x306B;&#x5C31;&#x304F;&#x306A;&#x3089;&#xFF0C;
&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x3082;&#x57FA;&#x790E;&#x77E5;&#x8B58;&#x3068;&#x3057;&#x3066;&#x77E5;&#x3063;&#x3066;&#x304A;&#x304F;&#x3079;&#x304D;&#x3060;&#x3002;
&#x4F8B;&#x3048;&#x3070;&#x81EA;&#x52D5;&#x8ECA;&#x306E;&#x8CA9;&#x58F2;&#x54E1;&#x304C;&#x300C;&#x79C1;&#x306F;&#x8CA9;&#x58F2;&#x54E1;&#x3060;&#x304B;&#x3089;&#x81EA;&#x52D5;&#x8ECA;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x306F;&#x308F;&#x304B;&#x308A;&#x307E;&#x305B;&#x3093;&#x300D;&#x3068;&#x8A00;&#x3046;&#x3053;&#x3068;&#x306F;&#x8A31;&#x3055;&#x308C;&#x308B;&#x3060;&#x308D;&#x3046;&#x304B;?
&#x81EA;&#x52D5;&#x8ECA;&#x306B;&#x95A2;&#x308F;&#x308B;&#x4ED5;&#x4E8B;&#x306B;&#x5C31;&#x3044;&#x3066;&#x3044;&#x308B;&#x306E;&#x306A;&#x3089;&#xFF0C;
&#x81EA;&#x52D5;&#x8ECA;&#x306E;&#x5185;&#x90E8;&#x3092;&#x3044;&#x3058;&#x308B;&#x3053;&#x3068;&#x304C;&#x4ED5;&#x4E8B;&#x3067;&#x306A;&#x304F;&#x3066;&#x3082;&#xFF0C;
&#x5185;&#x90E8;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x306E;&#x57FA;&#x672C;&#x7684;&#x306A;&#x77E5;&#x8B58;&#x306F;&#x8EAB;&#x306B;&#x4ED8;&#x3051;&#x3066;&#x304A;&#x304F;&#x3079;&#x304D;&#x3067;&#x306F;&#x306A;&#x3044;&#x304B;?
&#x300C;&#x8155;&#x524D;&#x300D;&#x3084;&#x30B9;&#x30AD;&#x30EB;&#x3068;&#x3057;&#x3066;&#x767A;&#x63EE;&#x3059;&#x308B;&#x6A5F;&#x4F1A;&#x306F;&#x306A;&#x304F;&#x3068;&#x3082;&#xFF0C;
&#x305D;&#x306E;&#x77E5;&#x8B58;&#x306F;&#x304D;&#x3063;&#x3068;&#x305D;&#x306E;&#x4EBA;&#x306E;&#x4ED5;&#x4E8B;&#x306E;&#x8CEA;&#x3092;&#x826F;&#x304F;&#x3059;&#x308B;&#x3002;
&#x65B0;&#x3057;&#x3044;&#x30A2;&#x30A4;&#x30C7;&#x30A3;&#x30A2;&#x304C;&#x5FC5;&#x8981;&#x306A;&#x3068;&#x304D;&#xFF0C;
&#x89E3;&#x6C7A;&#x7B56;&#x3092;&#x898B;&#x3064;&#x3051;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3068;&#x304D;&#xFF0C;
&#x5229;&#x7528;&#x8005;&#x306E;&#x305F;&#x3081;&#x306B;&#x8AAC;&#x660E;&#x66F8;&#x3092;&#x66F8;&#x304F;&#x3068;&#x304D;&#xFF0C;
&#x5185;&#x90E8;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x3092;&#x77E5;&#x3063;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x306F;&#x591A;&#x3044;&#x306B;&#x5F79;&#x7ACB;&#x3064;&#x3060;&#x308D;&#x3046;&#x3002;</p><p>&#x3053;&#x306E;&#x6388;&#x696D;&#x306E;&#x5927;&#x304D;&#x306A;&#x76EE;&#x6A19;&#x306F;&#xFF0C;&#x3053;&#x308C;&#x307E;&#x3067;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306B;&#x3064;&#x3044;&#x3066;&#x5B66;&#x3093;&#x3060;&#x3053;&#x3068;&#x3092;&#xFF0C;
&#x305D;&#x306E;&#x571F;&#x53F0;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x304C;&#x3069;&#x3046;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x304B;&#x8997;&#x304D;&#x306A;&#x304C;&#x3089;&#x5B66;&#x3073;&#x76F4;&#x3059;&#x3053;&#x3068;&#x3060;&#x3002;
&#x3067;&#x3082;&#x305D;&#x308C;&#x3063;&#x3066;&#x304B;&#x306A;&#x308A;&#x5927;&#x5909;&#x3060;&#x3002;
&#x4F8B;&#x3048;&#x3070;&#xFF0C;TV&#x3092;&#x89B3;&#x308B;&#x306E;&#x306F;&#x7C21;&#x5358;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x305D;&#x308C;&#x304C;&#x3069;&#x3046;&#x3044;&#x3046;&#x4ED5;&#x7D44;&#x307F;&#x3067;&#x5B9F;&#x73FE;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#xFF0C;
&#x300C;&#x88CF;&#x84CB;&#x3092;&#x958B;&#x3044;&#x3066;&#x3059;&#x3079;&#x3066;&#x306E;&#x90E8;&#x54C1;&#x3092;&#x53D6;&#x308A;&#x5916;&#x3057;&#x3066;&#x4E00;&#x500B;&#x4E00;&#x500B;&#x306E;&#x5F79;&#x5272;&#x3092;&#x8ABF;&#x3079;&#x3066;&#x5B66;&#x3076;&#x300D;&#x3053;&#x3068;&#x3092;&#x60F3;&#x50CF;&#x3057;&#x3066;&#x307F;&#x308C;&#x3070;&#x3044;&#x3044;&#x3002;
&#x300C;TV&#x3067;&#x6620;&#x50CF;&#x756A;&#x7D44;&#x3092;&#x89B3;&#x308B;&#x300D;&#x3053;&#x3068;&#x306F;&#x65E5;&#x5E38;&#x7684;&#x3067;&#x7C21;&#x5358;&#x306A;&#x4E8B;&#x67C4;&#x3060;&#x3068;&#x50D5;&#x3089;&#x306F;&#x601D;&#x3063;&#x3066;&#x3044;&#x308B;&#x3051;&#x308C;&#x3069;&#xFF0C;
&#x305D;&#x306E;&#x7C21;&#x5358;&#x306B;&#x898B;&#x3048;&#x308B;&#x4E8B;&#x67C4;&#x304C;&#x5B9F;&#x306F;&#xFF0C;
&#x4ECA;&#x307E;&#x3067;&#x610F;&#x8B58;&#x3057;&#x3066;&#x3044;&#x306A;&#x304B;&#x3063;&#x305F;&#xFF0C;&#x88CF;&#x84CB;&#x306E;&#x4E2D;&#x306B;&#x96A0;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;&#xFF0C;&#x5927;&#x91CF;&#x306E;&#x90E8;&#x54C1;&#x306E;&#x8907;&#x96D1;&#x306A;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x306B;&#x3088;&#x3063;&#x3066;&#x5B9F;&#x73FE;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;
&#x305F;&#x3076;&#x3093;&#x6B21;&#x304B;&#x3089;&#x6B21;&#x3078;&#x3068;&#x90E8;&#x54C1;&#x304C;&#x51FA;&#x3066;&#x304D;&#x3066;&#x304D;&#x308A;&#x304C;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x611F;&#x3058;&#x3089;&#x308C;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002;
&#x90E8;&#x54C1;&#x306E;&#x5F79;&#x5272;&#x3092;&#x5B66;&#x3076;&#x305F;&#x3081;&#x306B;&#x306F;&#x305D;&#x3082;&#x305D;&#x3082;&#x96FB;&#x5B50;&#x56DE;&#x8DEF;&#x306E;&#x7406;&#x8AD6;&#x306B;&#x95A2;&#x3059;&#x308B;&#x77E5;&#x8B58;&#x304C;&#x5FC5;&#x8981;&#x3060;&#x3002;
&#x3055;&#x3089;&#x306B;&#x306F;&#xFF0C;&#x88CF;&#x84CB;&#x3092;&#x958B;&#x3044;&#x3066;&#x90E8;&#x54C1;&#x3092;&#x53D6;&#x308A;&#x5916;&#x3057;&#x3066;&#x3044;&#x304F;&#x305F;&#x3081;&#x306B;&#x300C;&#x6B63;&#x3057;&#x3044;&#x306D;&#x3058;&#x56DE;&#x3057;&#x306E;&#x4F7F;&#x3044;&#x65B9;&#x300D;&#x3059;&#x3089;&#x5B66;&#x3070;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x304B;&#x3082;&#x77E5;&#x308C;&#x306A;&#x3044;&#x3002;
&#x300C;&#x96A0;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x90E8;&#x5206;&#x3092;&#x958B;&#x3044;&#x3066;&#x8ABF;&#x3079;&#x3066;&#x7406;&#x89E3;&#x3059;&#x308B;&#x300D;&#x3053;&#x3068;&#x306F;&#x672C;&#x5F53;&#x306B;&#x624B;&#x9593;&#x306E;&#x639B;&#x304B;&#x308B;&#x3053;&#x3068;&#x3060;&#x3002;
&#x3057;&#x304B;&#x3082;&#xFF0C;&#x6388;&#x696D;&#x306E;&#x9650;&#x3089;&#x308C;&#x305F;&#x6642;&#x9593;&#x3067;&#x5B66;&#x3079;&#x308B;&#x3053;&#x3068;&#x306F;&#x300C;&#x5185;&#x90E8;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x300D;&#x306E;&#x307B;&#x3093;&#x306E;&#x4E00;&#x90E8;&#x306B;&#x904E;&#x304E;&#x306A;&#x3044;&#x3002;
&#x305D;&#x308C;&#x3067;&#x3082;&#xFF0C;&#x307B;&#x3093;&#x306E;&#x4E00;&#x90E8;&#x3067;&#x3082;&#x571F;&#x53F0;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x3092;&#x77E5;&#x308A;&#xFF0C;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306E;&#x57FA;&#x672C;&#x69CB;&#x9020;&#x3092;&#x77E5;&#x308B;&#x3060;&#x3051;&#x3067;&#xFF0C;
&#x300C;&#x666E;&#x901A;&#x306B;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x3060;&#x3051;&#x300D;&#x3088;&#x308A;&#x3082;&#x305A;&#x3063;&#x3068;&#x6DF1;&#x304F;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3092;&#x7406;&#x89E3;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308B;&#x306F;&#x305A;&#x3060;&#x3002;</p><p><img alt="Raspberry Pi Photo" src="images/7988262046_b198c90a69_h.jpg" width="400" height="268">
<span style="font-size:smaller">
Photo: <a href="https://www.flickr.com/photos/gijsbertpeijs/7988262046/" target="_blank">GijsbertPeijs</a> / <a href="http://creativecommons.org/licenses/by/2.0/" target="_blank">CC BY</a>
(brightness adjusted)
</span></p><p>&#x3053;&#x306E;&#x6388;&#x696D;&#x306F;&#x4E3B;&#x306B;2&#x3064;&#x306E;&#x984C;&#x6750;&#x3092;&#x6271;&#x3046;&#x3002;
<b>&#x30A2;&#x30BB;&#x30F3;&#x30D6;&#x30EA;&#x8A00;&#x8A9E;</b> (assembly language) &#x306B;&#x3088;&#x308B;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x3068;&#xFF0C;
&#x305D;&#x308C;&#x306B;&#x3088;&#x308B;<b>&#x5358;&#x57FA;&#x677F;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;</b> (single-board computer) <b>&#x306E;&#x5236;&#x5FA1;</b>&#x3060;&#x3002;
&#x30A2;&#x30BB;&#x30F3;&#x30D6;&#x30EA;&#x8A00;&#x8A9E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x3068;&#x306F;&#x4E00;&#x8A00;&#x3067;&#x8A00;&#x3048;&#x3070;&#xFF0C;
&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30E9;&#x3092;&#x4F7F;&#x308F;&#x305A;&#xFF0C;&#x6A5F;&#x68B0;&#x304C;&#x5B9F;&#x884C;&#x3067;&#x304D;&#x308B;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x76F4;&#x63A5;&#x66F8;&#x304F;&#x3063;&#x3066;&#x3053;&#x3068;&#x3060;&#x3002;
&#x3067;&#x3082;&#xFF0C;&#x4E0A;&#x3067;&#x3082;&#x8A00;&#x3063;&#x305F;&#x3088;&#x3046;&#x306B;&#xFF0C;&#x300C;&#x30A2;&#x30BB;&#x30F3;&#x30D6;&#x30EA;&#x8A00;&#x8A9E;&#x3067;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x66F8;&#x304F;&#x300D;&#x3068;&#x3044;&#x3046;&#x300C;&#x30B9;&#x30AD;&#x30EB;&#x300D;&#x3092;&#x8EAB;&#x306B;&#x4ED8;&#x3051;&#x308B;&#x3053;&#x3068;&#x304C;&#x76EE;&#x7684;&#x3058;&#x3083;&#x306A;&#x3044;&#x3002;
&#x6A5F;&#x68B0;&#x304C;&#x5B9F;&#x884C;&#x3067;&#x304D;&#x308B;&#x547D;&#x4EE4;&#x3068;&#x306F;&#x3069;&#x3046;&#x3044;&#x3046;&#x3082;&#x306E;&#x304B;&#xFF0C;
if, for, while&#x3084;&#x5909;&#x6570;&#x3084;&#x914D;&#x5217;&#x3084;&#x95A2;&#x6570;&#x547C;&#x3073;&#x51FA;&#x3057;&#x3068;&#x3069;&#x3046;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#xFF0C;
&#x96FB;&#x5B50;&#x56DE;&#x8DEF;&#x3067;&#x3042;&#x308B;&#x30CF;&#x30FC;&#x30C9;&#x30A6;&#x30A7;&#x30A2;&#x3068;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306F;&#x3069;&#x3046;&#x95A2;&#x4FC2;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#xFF0C;
&#x3068;&#x3044;&#x3063;&#x305F;&#x77E5;&#x8B58;&#x3092;&#x8EAB;&#x306B;&#x4ED8;&#x3051;&#x308B;&#x3053;&#x3068;&#x304C;&#x76EE;&#x7684;&#x3060;&#x3002;
&#x305D;&#x3057;&#x3066;&#xFF0C;&#x30CF;&#x30FC;&#x30C9;&#x30A6;&#x30A7;&#x30A2;&#x3068;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x95A2;&#x4FC2;&#x3092;&#x3088;&#x308A;&#x6DF1;&#x304F;&#x7406;&#x89E3;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#xFF0C;
&#x624B;&#x306E;&#x3072;&#x3089;&#x30B5;&#x30A4;&#x30BA;&#x306E;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;Raspberry Pi&#xFF08;&#x4E0A;&#x306E;&#x5199;&#x771F;&#xFF09;&#x3092;&#x64CD;&#x308B;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x3002;
&#x5916;&#x90E8;&#x306B;&#x63A5;&#x7D9A;&#x3057;&#x305F;&#x767A;&#x5149;&#x30C0;&#x30A4;&#x30AA;&#x30FC;&#x30C9; (LED) &#x3092;&#x5149;&#x3089;&#x305B;&#x305F;&#x308A;&#x30B9;&#x30A4;&#x30C3;&#x30C1;&#x306E;&#x30AA;&#x30F3;&#x30AA;&#x30D5;&#x3092;&#x8AAD;&#x307F;&#x53D6;&#x3063;&#x305F;&#x308A;&#x3059;&#x308B;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x4F5C;&#x308B;&#x3053;&#x3068;&#x3067;&#xFF0C;
&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3068;&#x3044;&#x3046;&#x6A5F;&#x68B0;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x3084;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3068;&#x306E;&#x95A2;&#x308F;&#x308A;&#x3092;&#x5B9F;&#x611F;&#x3057;&#x306A;&#x304C;&#x3089;&#x5B66;&#x3079;&#x308B;&#xFF0C;
&#x3068;&#x671F;&#x5F85;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;</p><p>&#x3053;&#x306E;&#x6388;&#x696D;&#x306E;&#x9593;&#x4E2D;&#xFF0C;&#x6B21;&#x3005;&#x3068;&#x672A;&#x77E5;&#x306E;&#x4E8B;&#x67C4;&#x304C;&#x73FE;&#x308C;&#x3066;&#x304D;&#x3063;&#x3068;&#x53F3;&#x5F80;&#x5DE6;&#x5F80;&#x3057;&#x305F;&#x308A;&#x9014;&#x65B9;&#x306B;&#x304F;&#x308C;&#x305F;&#x308A;&#x3059;&#x308B;&#x3068;&#x601D;&#x3046;&#x3051;&#x3069;&#xFF0C;
&#x305D;&#x308C;&#x3089;&#x306E;&#x4E8B;&#x67C4;&#x306F;&#x7686;&#xFF0C;&#x30D1;&#x30BD;&#x30B3;&#x30F3;&#x3084;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30D5;&#x30A9;&#x30F3;&#x3092;&#x300C;&#x666E;&#x901A;&#x306B;&#x300D;&#x4F7F;&#x3048;&#x308B;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x300C;&#x571F;&#x53F0;&#x300D;&#x3060;&#x3002;
&#x305D;&#x308C;&#x3092;&#x5C11;&#x3057;&#x305A;&#x3064;&#x89E3;&#x304D;&#x660E;&#x304B;&#x3057;&#x3066;&#x3044;&#x304F;&#x306E;&#x306F;&#x697D;&#x3057;&#x3044;&#x3053;&#x3068;&#x3067;&#x3082;&#x3042;&#x308B;&#x3068;&#x601D;&#x3046;&#x3002;
&#x541B;&#x305F;&#x3061;&#x306B;&#x3068;&#x3063;&#x3066;&#x624B;&#x5F37;&#x3044;&#x6388;&#x696D;&#x3060;&#x3068;&#x601D;&#x3046;&#x3051;&#x3069;&#xFF0C;&#x5C11;&#x3057;&#x899A;&#x609F;&#x3092;&#x6C7A;&#x3081;&#x3066;&#xFF0C;&#x3067;&#x3082;&#x904E;&#x5EA6;&#x306B;&#x6050;&#x308C;&#x3059;&#x304E;&#x305A;&#xFF0C;&#x300C;&#x5185;&#x90E8;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x300D;&#x306B;&#x7ACB;&#x3061;&#x5411;&#x304B;&#x3063;&#x3066;&#x6B32;&#x3057;&#x3044;&#x3002;
&#x3053;&#x306E;&#x6388;&#x696D;&#x3092;&#x7D42;&#x3048;&#x3066;&#x300C;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3068;&#x3044;&#x3046;&#x6A5F;&#x68B0;&#x3092;&#x524D;&#x3088;&#x308A;&#x3082;&#x3063;&#x3068;&#x7406;&#x89E3;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x305F;&#x300D;&#x3068;&#x601D;&#x3048;&#x308B;&#x3088;&#x3046;&#x306B;&#xFF0C;
&#x7686;&#x304C;&#x7121;&#x4E8B;&#x305D;&#x3053;&#x307E;&#x3067;&#x5230;&#x9054;&#x3067;&#x304D;&#x308B;&#x3053;&#x3068;&#x3092;&#x9858;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;</p><p>2016.10.1 ytakata</p>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="goal.html" class="navigation navigation-next " aria-label="Next page: 達成目標">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"はじめに","level":"1.2","depth":1,"next":{"title":"達成目標","level":"1.2.1","depth":2,"path":"preface/goal.md","ref":"preface/goal.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"情報学群実験第2","gitbook":"*"},"file":{"path":"preface/README.md","mtime":"2016-09-02T02:00:28.000Z","type":"markdown"},"gitbook":{"version":"3.2.0","time":"2016-10-28T08:16:58.511Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

